content/emacs/configs/07-org.org
#+TITLE: Knowledge Management
#+AUTHOR: Kyeong Soo Choi
#+STARTUP: overview
#+OPTIONS: toc:2 num:3
#+PROPERTY: header-args:emacs-lisp :mkdirp yes :results none

Configuration for Org-mode and knowledge management tools including org-roam, org-gcal, and related packages.

* Org Mode Core Configuration

Core Org-mode settings including babel languages, templates, and basic customization.

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/org-conf.el
  ;;; org-conf.el --- Org-mode and knowledge management configuration  -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:

  ;; Configure browser for opening URLs (fixes LaTeXiT issue on macOS)
  (setq browse-url-browser-function 'browse-url-default-macosx-browser)

  ;; Required packages for org extensions
  (use-package org-contrib)
  (use-package ob-typescript)
  (use-package ob-powershell)
  (use-package ob-http)
  (use-package ob-restclient)

  (use-package org
    :pin org
    :commands (org-capture org-agenda)
    :custom
    ;; Agenda and logging
    (org-agenda-start-with-log-mode t)
    (org-log-done 'time)
    (org-log-into-drawer t)

    ;; Editing behavior
    (org-catch-invisible-edits 'show)
    (org-edit-timestamp-down-means-later t)
    (org-fast-tag-selection-single-key 'expert)
    (org-src-window-setup 'current-window)

    ;; Export settings
    (org-export-coding-system 'utf-8)
    (org-export-kill-product-buffer-when-displayed t)
    (org-html-validation-link nil)

    ;; LaTeX export
    (org-latex-compiler "xelatex")
    (org-latex-pdf-process '("latexmk -xelatex -synctex=1 -f -interaction=nonstopmode -output-directory=%o %f"))

    ;; Display and appearance
    (org-hide-emphasis-markers t)
    (org-pretty-entities nil)
    (org-startup-indented nil)
    (org-startup-with-inline-images t)
    (org-display-remote-inline-images 'download)
    (org-image-actual-width '(450))
    (org-tags-column 80)

    :config
    ;; Load org-tempo for easy template expansion
    (require 'org-tempo)

    ;; Load babel language support
    (require 'ob-js)
    (require 'ob-typescript)
    (require 'ob-ruby)

    ;; Add custom structure templates
    (add-to-list 'org-structure-template-alist '("txt"  . "src text"))
    (add-to-list 'org-structure-template-alist '("cc"   . "src C"))
    (add-to-list 'org-structure-template-alist '("sh"   . "src shell"))
    (add-to-list 'org-structure-template-alist '("zsh"  . "src zsh"))
    (add-to-list 'org-structure-template-alist '("bash" . "src bash"))
    (add-to-list 'org-structure-template-alist '("posh" . "src powershell"))
    (add-to-list 'org-structure-template-alist '("el"   . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("py"   . "src python"))
    (add-to-list 'org-structure-template-alist '("js"   . "src js"))
    (add-to-list 'org-structure-template-alist '("ts"   . "src typescript"))
    (add-to-list 'org-structure-template-alist '("java" . "src java"))
    (add-to-list 'org-structure-template-alist '("scm"  . "src scheme"))
    (add-to-list 'org-structure-template-alist '("sql"  . "src sql"))
    (add-to-list 'org-structure-template-alist '("rust" . "src rust"))
    (add-to-list 'org-structure-template-alist '("rb"   . "src ruby"))

    ;; Enable babel languages - only load those that are available
    (org-babel-do-load-languages
     'org-babel-load-languages
     (seq-filter
      (lambda (pair)
        (locate-library (concat "ob-" (symbol-name (car pair)))))
      '((dot        . t)
        (C          . t)
        (gnuplot    . t)
        (latex      . t)
        (python     . t)
        (js         . t)
        (typescript . t)
        (shell      . t)
        (zsh        . t)
        (bash       . t)
        (posh       . t)
        (powershell . t)
        (scheme     . t)
        (sql        . t)
        (sqlite     . t)
        (ruby       . t)
        (emacs-lisp . t)
        (http       . t)
        (restclient . t))))

    ;; Fix electric-pair-mode for org-mode angle brackets
    (defun handle-electric-pair-inhibit (c)
      (if (char-equal c ?<) t (,electric-pair-inhibit-predicate c)))

    (defun handle-org-mode-hook()
      (setq-local electric-pair-inhibit-predicate #'handle-electric-pair-inhibit))

    (add-hook 'org-mode-hook #'handle-org-mode-hook)

    ;; Load org-remoteimg for remote image display
    (add-to-list 'load-path (expand-file-name "elisp/settings" user-emacs-directory))
    (require 'org-remoteimg))
#+end_src

