emacs/configs/07-org.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Knowledge Management</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1"><link rel="stylesheet" href="/assets/styles/toc-sidebar.css"></head>
<body>
<main id="content" class="prose prose-zinc dark:prose-invert mx-auto w-full max-w-xl md:max-w-xl lg:max-w-2xl xl:max-w-3xl px-4 sm:px-6 lg:px-8">
<h1 class="title">Knowledge Management</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge231981">1. Org Mode Core Configuration</a></li>
<li><a href="#orga4cf3a3">2. Org Download</a></li>
<li><a href="#org7955a86">3. Org Appear (Disabled)</a></li>
<li><a href="#org7cf526f">4. Org Google Calendar</a></li>
<li><a href="#orgab6487e">5. Org Remote Images</a></li>
<li><a href="#orga6d62b8">6. Org-Roam Configuration</a>
<ul>
<li><a href="#org11a3dbe">6.1. Core Setup</a></li>
<li><a href="#org4305839">6.2. Capture Templates</a></li>
<li><a href="#orgaff762a">6.3. Daily Notes Configuration</a></li>
<li><a href="#org1493c3f">6.4. Enhanced Node Display</a></li>
<li><a href="#orgc561522">6.5. Graph Visualization</a></li>
<li><a href="#orge8c0c43">6.6. UI Enhancement with org-roam-ui</a></li>
<li><a href="#orgfd06c26">6.7. Performance Optimizations</a></li>
<li><a href="#org17db810">6.8. Best Practices Summary</a></li>
<li><a href="#orgbf36e2e">6.9. Common Workflows</a></li>
</ul>
</li>
<li><a href="#org80286e9">7. Remote Access Setup</a>
<ul>
<li><a href="#org4759cd3">7.1. Overview of Remote Access Approaches</a></li>
<li><a href="#org1b42419">7.2. AWS EC2 / VPS Setup Guide</a></li>
<li><a href="#orgc71c3f5">7.3. Fast SSH Access with Mosh</a></li>
<li><a href="#orgea61317">7.4. org-roam-ui for Mobile Web Access</a></li>
<li><a href="#orgf5299d7">7.5. iOS Quick Capture Setup</a></li>
<li><a href="#orgc389e73">7.6. Git Sync Workflow</a></li>
<li><a href="#org5a7a028">7.7. Backup Strategy</a></li>
<li><a href="#org44d8773">7.8. Daily Workflow Examples</a></li>
<li><a href="#org253e866">7.9. Troubleshooting</a></li>
<li><a href="#org9d9a380">7.10. Cost Estimation</a></li>
<li><a href="#org3c0c616">7.11. Comparison to Notion/Obsidian</a></li>
<li><a href="#org7097c9d">7.12. References and Resources</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Configuration for Org-mode and knowledge management tools including org-roam, org-gcal, and related packages.
</p>

<div id="outline-container-orge231981" class="outline-2">
<h2 id="orge231981"><span class="section-number-2">1.</span> Org Mode Core Configuration</h2>
<div class="outline-text-2" id="text-1">
<p>
Core Org-mode settings including babel languages, templates, and basic customization.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">org-conf.el --- Org-mode and knowledge management configuration  -*- lexical-binding: t; -*-
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Configure browser for opening URLs (fixes LaTeXiT issue on macOS)
</span>(<span class="org-keyword">setq</span> browse-url-browser-function 'browse-url-default-macosx-browser)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Required packages for org extensions
</span>(<span class="org-keyword">use-package</span> org-contrib)
(<span class="org-keyword">use-package</span> ob-typescript)
(<span class="org-keyword">use-package</span> ob-powershell)
(<span class="org-keyword">use-package</span> ob-http)
(<span class="org-keyword">use-package</span> ob-restclient)

(<span class="org-keyword">use-package</span> org
  <span class="org-builtin">:pin</span> org
  <span class="org-builtin">:commands</span> (org-capture org-agenda)
  <span class="org-builtin">:custom</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Agenda and logging
</span>  (org-agenda-start-with-log-mode t)
  (org-log-done 'time)
  (org-log-into-drawer t)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Editing behavior
</span>  (org-catch-invisible-edits 'show)
  (org-edit-timestamp-down-means-later t)
  (org-fast-tag-selection-single-key 'expert)
  (org-src-window-setup 'current-window)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Export settings
</span>  (org-export-coding-system 'utf-8)
  (org-export-kill-product-buffer-when-displayed t)
  (org-html-validation-link nil)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">LaTeX export
</span>  (org-latex-compiler <span class="org-string">"xelatex"</span>)
  (org-latex-pdf-process '(<span class="org-string">"latexmk -xelatex -synctex=1 -f -interaction=nonstopmode -output-directory=%o %f"</span>))

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Display and appearance
</span>  (org-hide-emphasis-markers t)
  (org-pretty-entities nil)
  (org-startup-indented nil)
  (org-startup-with-inline-images t)
  (org-display-remote-inline-images 'download)
  (org-image-actual-width '(450))
  (org-tags-column 80)

  <span class="org-builtin">:config</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Load org-tempo for easy template expansion
</span>  (<span class="org-keyword">require</span> '<span class="org-constant">org-tempo</span>)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Load babel language support
</span>  (<span class="org-keyword">require</span> '<span class="org-constant">ob-js</span>)
  (<span class="org-keyword">require</span> '<span class="org-constant">ob-typescript</span>)
  (<span class="org-keyword">require</span> '<span class="org-constant">ob-ruby</span>)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Add custom structure templates
</span>  (add-to-list 'org-structure-template-alist '(<span class="org-string">"txt"</span>  . <span class="org-string">"src text"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"cc"</span>   . <span class="org-string">"src C"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"sh"</span>   . <span class="org-string">"src shell"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"zsh"</span>  . <span class="org-string">"src zsh"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"bash"</span> . <span class="org-string">"src bash"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"posh"</span> . <span class="org-string">"src powershell"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"el"</span>   . <span class="org-string">"src emacs-lisp"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"py"</span>   . <span class="org-string">"src python"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"js"</span>   . <span class="org-string">"src js"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"ts"</span>   . <span class="org-string">"src typescript"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"java"</span> . <span class="org-string">"src java"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"scm"</span>  . <span class="org-string">"src scheme"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"sql"</span>  . <span class="org-string">"src sql"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"rust"</span> . <span class="org-string">"src rust"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"rb"</span>   . <span class="org-string">"src ruby"</span>))

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Enable babel languages - only load those that are available
</span>  (org-babel-do-load-languages
   'org-babel-load-languages
   (seq-filter
    (<span class="org-keyword">lambda</span> (pair)
      (locate-library (concat <span class="org-string">"ob-"</span> (symbol-name (car pair)))))
    '((dot        . t)
      (C          . t)
      (gnuplot    . t)
      (latex      . t)
      (python     . t)
      (js         . t)
      (typescript . t)
      (shell      . t)
      (zsh        . t)
      (bash       . t)
      (posh       . t)
      (powershell . t)
      (scheme     . t)
      (sql        . t)
      (sqlite     . t)
      (ruby       . t)
      (emacs-lisp . t)
      (http       . t)
      (restclient . t))))

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Fix electric-pair-mode for org-mode angle brackets
</span>  (<span class="org-keyword">defun</span> <span class="org-function-name">handle-electric-pair-inhibit</span> (c)
    (<span class="org-keyword">if</span> (char-equal c ?&lt;) t (,electric-pair-inhibit-predicate c)))

  (<span class="org-keyword">defun</span> <span class="org-function-name">handle-org-mode-hook</span>()
    (<span class="org-keyword">setq-local</span> electric-pair-inhibit-predicate #'handle-electric-pair-inhibit))

  (add-hook 'org-mode-hook #'handle-org-mode-hook)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Load org-remoteimg for remote image display
</span>  (add-to-list 'load-path (expand-file-name <span class="org-string">"elisp/settings"</span> user-emacs-directory))
  (<span class="org-keyword">require</span> '<span class="org-constant">org-remoteimg</span>))
</pre>
</div>
</div>
</div>
