content/emacs/configs/07-org.org
* Org Download

Drag-and-drop images and screenshots into org buffers.

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/org-conf.el
  (use-package org-download
    :after org
    :custom
    ;; Store images in a local "images" directory
    (org-download-image-dir "images")

    ;; Don't create heading-based subdirectories
    (org-download-heading-lvl nil)

    ;; Screenshot method based on OS
    (org-download-screenshot-method
     (cond ((eq system-type 'darwin) "screencapture -i %s")
           ((eq system-type 'gnu/linux) "scrot -s %s")))

    :config
    ;; Enable inline display of remote images
    (setq org-download-display-inline-images 'posframe))
#+end_src

* Org Appear (Disabled)

Shows hidden emphasis markers and links when cursor is on them. Currently disabled.

#+begin_src emacs-lisp :tangle no
  (use-package org-appear
    :hook
    (org-mode . org-appear-mode)
    :custom
    (org-appear-autoemphasis t)
    (org-appear-autolinks t)
    (org-appear-autosubmarkers t)
    (org-appear-autoentities t)
    (org-appear-autokeywords t)
    (org-appear-inside-latex t)
    (org-appear-delay 0.0)
    (org-appear-trigger 'always))
#+end_src

* Org Google Calendar

Bidirectional sync between Org-mode and Google Calendar.

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/org-conf.el
  (use-package org-gcal
    :after org
    :custom
    ;; IMPORTANT: Set these variables in your private.el or custom-vars.el:
    ;; (setq org-gcal-client-id "your-client-id-from-google-console.apps.googleusercontent.com")
    ;; (setq org-gcal-client-secret "your-client-secret-from-google-console")
    ;; (setq org-gcal-file-alist '(("your-email@gmail.com" . "~/org/gcal.org")
    ;;                              ("another-calendar@gmail.com" . "~/org/work-gcal.org")))

    ;; Directory to store OAuth token and sync metadata
    (org-gcal-dir (expand-file-name ".org-gcal/" user-emacs-directory))

    ;; Token storage - use plain text file (no .gpg extension) to avoid encryption
    ;; The token file will have restricted file permissions (600) for security
    (org-gcal-token-file (expand-file-name ".org-gcal/token" user-emacs-directory))

    ;; Automatically fetch events when opening org-agenda
    (org-gcal-auto-archive nil)

    ;; Notify on sync
    (org-gcal-notify-p t)

    ;; Update events if they already exist (bidirectional sync)
    (org-gcal-update-cancelled-events-with-todo t)

    :init
    ;; CRITICAL: Disable plstore encryption BEFORE org-gcal loads
    ;; This must be in :init, not :config
    (setq plstore-cache-passphrase-for-symmetric-encryption t)
    (setq plstore-encrypt-to nil)

    ;; Ensure EPG context doesn't prompt for passphrase
    (setq epg-pinentry-mode 'loopback)

    ;; Auto-provide a passphrase if encryption can't be disabled
    ;; This prevents repeated prompts
    (defvar my/org-gcal-passphrase "emacs-gcal-token")
    (defun my/org-gcal-passphrase-callback (context key-id handback)
      "Automatically provide passphrase for org-gcal token encryption."
      my/org-gcal-passphrase)

    ;; Override EPG passphrase callback
    (setq epg-passphrase-callback-function #'my/org-gcal-passphrase-callback)

    :config
    ;; Additional workaround: advice plstore to disable encryption
    (when (fboundp 'plstore-open)
      (advice-add 'plstore-open :around
                  (lambda (orig-fun file)
                    (let ((plstore-encrypt-to nil))
                      (funcall orig-fun file)))))

    ;; Add org-gcal files to org-agenda-files if configured
    (when (and (boundp 'org-gcal-file-alist) org-gcal-file-alist)
      (dolist (calendar org-gcal-file-alist)
        (let ((gcal-file (cdr calendar)))
          ;; Create the file if it doesn't exist
          (unless (file-exists-p gcal-file)
            (make-directory (file-name-directory gcal-file) t)
            (write-region "" nil gcal-file))
          ;; Add to org-agenda-files if not already there
          (when (and (boundp 'org-agenda-files)
                     (not (member gcal-file org-agenda-files)))
            (add-to-list 'org-agenda-files gcal-file)))))

    :bind
    (("C-c g p" . org-gcal-post-at-point)
     ("C-c g d" . org-gcal-delete-at-point)
     ("C-c g r" . org-gcal-refresh-token)))
#+end_src

