emacs/configs/07-org.html

<div id="outline-container-orga4cf3a3" class="outline-2">
<h2 id="orga4cf3a3"><span class="section-number-2">2.</span> Org Download</h2>
<div class="outline-text-2" id="text-2">
<p>
Drag-and-drop images and screenshots into org buffers.
Automatically skipped on server/headless environments (requires GUI for screenshots).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Skip org-download on server (requires GUI for screenshots)
</span>(<span class="org-keyword">unless</span> emacs-server-mode
  (<span class="org-keyword">use-package</span> org-download
    <span class="org-builtin">:after</span> org
    <span class="org-builtin">:custom</span>
    <span class="org-comment-delimiter">;; </span><span class="org-comment">Store images in a local "images" directory
</span>    (org-download-image-dir <span class="org-string">"images"</span>)

    <span class="org-comment-delimiter">;; </span><span class="org-comment">Don't create heading-based subdirectories
</span>    (org-download-heading-lvl nil)

    <span class="org-comment-delimiter">;; </span><span class="org-comment">Screenshot method based on OS
</span>    (org-download-screenshot-method
     (<span class="org-keyword">cond</span> ((eq system-type 'darwin) <span class="org-string">"screencapture -i %s"</span>)
           ((eq system-type 'gnu/linux) <span class="org-string">"scrot -s %s"</span>)))

    <span class="org-builtin">:config</span>
    <span class="org-comment-delimiter">;; </span><span class="org-comment">Enable inline display of remote images
</span>    (<span class="org-keyword">setq</span> org-download-display-inline-images 'posframe)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org7955a86" class="outline-2">
<h2 id="org7955a86"><span class="section-number-2">3.</span> Org Appear (Disabled)</h2>
<div class="outline-text-2" id="text-3">
<p>
Shows hidden emphasis markers and links when cursor is on them. Currently disabled.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> org-appear
  <span class="org-builtin">:hook</span>
  (org-mode . org-appear-mode)
  <span class="org-builtin">:custom</span>
  (org-appear-autoemphasis t)
  (org-appear-autolinks t)
  (org-appear-autosubmarkers t)
  (org-appear-autoentities t)
  (org-appear-autokeywords t)
  (org-appear-inside-latex t)
  (org-appear-delay 0.0)
  (org-appear-trigger 'always))
</pre>
</div>
</div>
</div>

<div id="outline-container-org7cf526f" class="outline-2">
<h2 id="org7cf526f"><span class="section-number-2">4.</span> Org Google Calendar</h2>
<div class="outline-text-2" id="text-4">
<p>
Bidirectional sync between Org-mode and Google Calendar.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> org-gcal
  <span class="org-builtin">:after</span> org
  <span class="org-builtin">:custom</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">IMPORTANT: Set these variables in your private.el or custom-vars.el:
</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">(setq org-gcal-client-id "your-client-id-from-google-console.apps.googleusercontent.com")
</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">(setq org-gcal-client-secret "your-client-secret-from-google-console")
</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">(setq org-gcal-file-alist '(("your-email@gmail.com" . "~/org/gcal.org")
</span>  <span class="org-comment-delimiter">;;                              </span><span class="org-comment">("another-calendar@gmail.com" . "~/org/work-gcal.org")))
</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Directory to store OAuth token and sync metadata
</span>  (org-gcal-dir (expand-file-name <span class="org-string">".org-gcal/"</span> user-emacs-directory))

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Token storage - use plain text file (no .gpg extension) to avoid encryption
</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">The token file will have restricted file permissions (600) for security
</span>  (org-gcal-token-file (expand-file-name <span class="org-string">".org-gcal/token"</span> user-emacs-directory))

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Automatically fetch events when opening org-agenda
</span>  (org-gcal-auto-archive nil)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Notify on sync
</span>  (org-gcal-notify-p t)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Update events if they already exist (bidirectional sync)
</span>  (org-gcal-update-cancelled-events-with-todo t)

  <span class="org-builtin">:init</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">CRITICAL: Disable plstore encryption BEFORE org-gcal loads
</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">This must be in :init, not :config
</span>  (<span class="org-keyword">setq</span> plstore-cache-passphrase-for-symmetric-encryption t)
  (<span class="org-keyword">setq</span> plstore-encrypt-to nil)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Ensure EPG context doesn't prompt for passphrase
</span>  (<span class="org-keyword">setq</span> epg-pinentry-mode 'loopback)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Auto-provide a passphrase if encryption can't be disabled
</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">This prevents repeated prompts
</span>  (<span class="org-keyword">defvar</span> <span class="org-variable-name">my/org-gcal-passphrase</span> <span class="org-string">"emacs-gcal-token"</span>)
  (<span class="org-keyword">defun</span> <span class="org-function-name">my/org-gcal-passphrase-callback</span> (context key-id handback)
    <span class="org-doc">"Automatically provide passphrase for org-gcal token encryption."</span>
    my/org-gcal-passphrase)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Override EPG passphrase callback
</span>  (<span class="org-keyword">setq</span> epg-passphrase-callback-function #'my/org-gcal-passphrase-callback)

  <span class="org-builtin">:config</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Additional workaround: advice plstore to disable encryption
</span>  (<span class="org-keyword">when</span> (fboundp 'plstore-open)
    (advice-add 'plstore-open <span class="org-builtin">:around</span>
                (<span class="org-keyword">lambda</span> (orig-fun file)
                  (<span class="org-keyword">let</span> ((plstore-encrypt-to nil))
                    (funcall orig-fun file)))))

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Add org-gcal files to org-agenda-files if configured
</span>  (<span class="org-keyword">when</span> (<span class="org-keyword">and</span> (boundp 'org-gcal-file-alist) org-gcal-file-alist)
    (<span class="org-keyword">dolist</span> (calendar org-gcal-file-alist)
      (<span class="org-keyword">let</span> ((gcal-file (cdr calendar)))
        <span class="org-comment-delimiter">;; </span><span class="org-comment">Create the file if it doesn't exist
</span>        (<span class="org-keyword">unless</span> (file-exists-p gcal-file)
          (make-directory (file-name-directory gcal-file) t)
          (write-region <span class="org-string">""</span> nil gcal-file))
        <span class="org-comment-delimiter">;; </span><span class="org-comment">Add to org-agenda-files if not already there
</span>        (<span class="org-keyword">when</span> (<span class="org-keyword">and</span> (boundp 'org-agenda-files)
                   (not (member gcal-file org-agenda-files)))
          (add-to-list 'org-agenda-files gcal-file)))))

  <span class="org-builtin">:bind</span>
  ((<span class="org-string">"C-c g p"</span> . org-gcal-post-at-point)
   (<span class="org-string">"C-c g d"</span> . org-gcal-delete-at-point)
   (<span class="org-string">"C-c g r"</span> . org-gcal-refresh-token)))
</pre>
</div>
</div>
</div>
