emacs/configs/07-org.html

<div id="outline-container-orgab6487e" class="outline-2">
<h2 id="orgab6487e"><span class="section-number-2">5.</span> Org Remote Images</h2>
<div class="outline-text-2" id="text-5">
<p>
Display remote HTTP/HTTPS images inline in org buffers with automatic caching.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">org-remoteimg.el --- Display remote inline images in org-mode -*- lexical-binding: t -*-
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Copyright (C) 2023 Dean Gao - MIT License
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">Author: Dean Gao <a href="mailto:gao.dean%40hotmail.com">&lt;gao.dean@hotmail.com&gt;</a>
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">Description: Inline display of remote images in org-mode
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">Homepage: https://github.com/gaoDean/org-imgtog
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">Package-Requires: ((emacs "25.1"))
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Permission is hereby granted, free of charge, to any person obtaining a copy
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">of this software and associated documentation files (the "Software"), to deal
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">in the Software without restriction, including without limitation the rights
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">copies of the Software, and to permit persons to whom the Software is
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">furnished to do so, subject to the following conditions:
</span><span class="org-comment-delimiter">;;</span><span class="org-comment">
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">The above copyright notice and this permission notice shall be included in all
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">copies or substantial portions of the Software.
</span><span class="org-comment-delimiter">;;</span><span class="org-comment">
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">SOFTWARE.
</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This package displays remote images inline in org-mode with automatic caching.
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">This means you can do \[\[https://my-file.png\]\], and have it display inline.
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">The next time you visit the file or fetch the image, it will be instantly
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">fetched from the cache.
</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:
</span>
(<span class="org-keyword">require</span> '<span class="org-constant">org</span>)
(<span class="org-keyword">require</span> '<span class="org-constant">org-element</span>)
(<span class="org-keyword">require</span> '<span class="org-constant">url</span>)
(<span class="org-keyword">require</span> '<span class="org-constant">url-cache</span>)

(<span class="org-keyword">unless</span> (fboundp 'image-supported-file-p)
  <span class="org-comment-delimiter">;; </span><span class="org-comment">`</span><span class="org-comment"><span class="org-constant">image-supported-file-p</span></span><span class="org-comment">' isn't available before Emacs 28
</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">Add alias to not break Emacs &lt;28.
</span>  (<span class="org-keyword">defalias</span> '<span class="org-function-name">image-type-from-file-name</span> 'image-supported-file-p))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Compatibility definitions for Org-mode &lt; 9.8
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">In Org &lt; 9.8, the variable is called org-inline-image-overlays
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">In Org &gt;= 9.8, it was renamed to org-link-preview-overlays
</span>(<span class="org-keyword">unless</span> (boundp 'org-link-preview-overlays)
  (<span class="org-keyword">defvaralias</span> '<span class="org-variable-name">org-link-preview-overlays</span> 'org-inline-image-overlays
    <span class="org-doc">"Compatibility alias for org-inline-image-overlays in Org &lt; 9.8."</span>))

(<span class="org-keyword">defun</span> <span class="org-function-name">org-image-update-overlay</span> (file link <span class="org-type">&amp;optional</span> data-p refresh)
  <span class="org-doc">"Create image overlay for FILE associtated with org-element LINK.
If DATA-P is non-nil FILE is not a file name but a string with the image data.
If REFRESH is non-nil don't download the file but refresh the image.
See also `</span><span class="org-doc"><span class="org-constant">create-image</span></span><span class="org-doc">'.
This function is almost a duplicate of a part of `</span><span class="org-doc"><span class="org-constant">org-display-inline-images</span></span><span class="org-doc">'."</span>
  (<span class="org-keyword">when</span> (<span class="org-keyword">or</span> data-p (file-exists-p file))
    (<span class="org-keyword">let</span> ((width
           <span class="org-comment-delimiter">;; </span><span class="org-comment">Apply `</span><span class="org-comment"><span class="org-constant">org-image-actual-width</span></span><span class="org-comment">' specifications.
</span>           (<span class="org-keyword">cond</span>
            ((eq org-image-actual-width t) nil)
            ((listp org-image-actual-width)
             (<span class="org-keyword">or</span>
              <span class="org-comment-delimiter">;; </span><span class="org-comment">First try to find a width among
</span>              <span class="org-comment-delimiter">;; </span><span class="org-comment">attributes associated to the paragraph
</span>              <span class="org-comment-delimiter">;; </span><span class="org-comment">containing link.
</span>              (<span class="org-keyword">let</span> ((paragraph
                     (<span class="org-keyword">let</span> ((e link))
                       (<span class="org-keyword">while</span> (<span class="org-keyword">and</span> (<span class="org-keyword">setq</span> e (org-element-property
                                            <span class="org-builtin">:parent</span> e))
                                   (not (eq (org-element-type e)
                                            'paragraph))))
                       e)))
                (<span class="org-keyword">when</span> paragraph
                  (<span class="org-keyword">save-excursion</span>
                    (goto-char (org-element-property <span class="org-builtin">:begin</span> paragraph))
                    (<span class="org-keyword">when</span>
                        (re-search-forward
                         <span class="org-string">"^[ \t]*#\\+attr_.*?: +.*?:width +</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">\\S-+</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">"</span>
                         (org-element-property
                          <span class="org-builtin">:post-affiliated</span> paragraph)
                         t)
                      (string-to-number (match-string 1))))))
              <span class="org-comment-delimiter">;; </span><span class="org-comment">Otherwise, fall-back to provided number.
</span>              (car org-image-actual-width)))
            ((numberp org-image-actual-width)
             org-image-actual-width)))
          (old (get-char-property-and-overlay
                (org-element-property <span class="org-builtin">:begin</span> link)
                'org-image-overlay)))
      (<span class="org-keyword">if</span> (<span class="org-keyword">and</span> (car-safe old) refresh)
          (image-flush (overlay-get (cdr old) 'display))
        (<span class="org-keyword">let</span> ((image (create-image file
                                   (<span class="org-keyword">and</span> (image-type-available-p 'imagemagick)
                                        width
                                        'imagemagick)
                                   data-p
                                   <span class="org-builtin">:width</span> width)))
          (<span class="org-keyword">when</span> image
            (<span class="org-keyword">let*</span> ((link
                    <span class="org-comment-delimiter">;; </span><span class="org-comment">If inline image is the description
</span>                    <span class="org-comment-delimiter">;; </span><span class="org-comment">of another link, be sure to
</span>                    <span class="org-comment-delimiter">;; </span><span class="org-comment">consider the latter as the one to
</span>                    <span class="org-comment-delimiter">;; </span><span class="org-comment">apply the overlay on.
</span>                    (<span class="org-keyword">let</span> ((parent
                           (org-element-property <span class="org-builtin">:parent</span> link)))
                      (<span class="org-keyword">if</span> (eq (org-element-type parent) 'link)
                          parent
                        link)))
                   (ov (make-overlay
                        (org-element-property <span class="org-builtin">:begin</span> link)
                        (<span class="org-keyword">progn</span>
                          (goto-char
                           (org-element-property <span class="org-builtin">:end</span> link))
                          (skip-chars-backward <span class="org-string">" \t"</span>)
                          (point)))))
              (overlay-put ov 'display image)
              (overlay-put ov 'face 'default)
              (overlay-put ov 'org-image-overlay t)
              (overlay-put
               ov 'modification-hooks
               (list 'org-display-inline-remove-overlay))
              (<span class="org-keyword">push</span> ov org-link-preview-overlays)
              ov)))))))

(<span class="org-keyword">defun</span> <span class="org-function-name">org-display-user-inline-images</span> (<span class="org-type">&amp;optional</span> _include-linked _refresh beg end)
  <span class="org-doc">"Like `</span><span class="org-doc"><span class="org-constant">org-display-inline-images</span></span><span class="org-doc">' but for image data links.
_INCLUDE-LINKED and _REFRESH are ignored.
Restrict to region between BEG and END if both are non-nil.
Image data links have a :image-data-fun parameter.
\(See `</span><span class="org-doc"><span class="org-constant">org-link-set-parameters</span></span><span class="org-doc">'.)
The value of the :image-data-fun parameter is a function
taking the PROTOCOL, the LINK, and the DESCRIPTION as arguments.
If that function returns nil the link is not interpreted as image.
Otherwise the return value is the image data string to be displayed.

Note that only bracket links are allowed as image data links
with one of the formats
 [[PROTOCOL:LINK]]
or
 [[PROTOCOL:LINK][DESCRIPTION]]
are recognized.
Full credit goes to org-yt by Tobias Zawada for this function."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">when</span> (<span class="org-keyword">and</span> (called-interactively-p 'any)
             (use-region-p))
    (<span class="org-keyword">setq</span> beg (region-beginning)
          end (region-end)))
  (<span class="org-keyword">when</span> (display-graphic-p)
    (<span class="org-keyword">org-with-wide-buffer</span>
     (goto-char (<span class="org-keyword">or</span> beg (point-min)))
     (<span class="org-keyword">when-let*</span> ((image-data-link-parameters
               (<span class="org-keyword">cl-loop</span> for link-par-entry in org-link-parameters
                        with fun
                        when (<span class="org-keyword">setq</span> fun (plist-get (cdr link-par-entry) <span class="org-builtin">:image-data-fun</span>))
                        collect (cons (car link-par-entry) fun)))
              (image-data-link-re (regexp-opt (mapcar 'car image-data-link-parameters)))
              (re (format <span class="org-string">"\\[\\[</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">%s</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">:</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">[</span><span class="org-string"><span class="org-negation-char">^</span></span><span class="org-string">]]+</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">\\]</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(?:</span></span><span class="org-string">\\[</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">[</span><span class="org-string"><span class="org-negation-char">^</span></span><span class="org-string">]]+</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">\\]</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">?\\]"</span>
                          image-data-link-re)))
       (<span class="org-keyword">while</span> (re-search-forward re end t)
         (<span class="org-keyword">let*</span> ((protocol (match-string-no-properties 1))
              (link (match-string-no-properties 2))
              (description (match-string-no-properties 3))
              (image-data-link (assoc-string protocol image-data-link-parameters))
              (el (<span class="org-keyword">save-excursion</span> (goto-char (match-beginning 1)) (org-element-context)))
              image-data)
           (<span class="org-keyword">when</span> el
             (<span class="org-keyword">setq</span> image-data
                   (<span class="org-keyword">or</span> (<span class="org-keyword">let</span> ((old (get-char-property-and-overlay
                                   (org-element-property <span class="org-builtin">:begin</span> el)
                                   'org-image-overlay)))
                         (<span class="org-keyword">and</span> old
                              (car-safe old)
                              (overlay-get (cdr old) 'display)))
                     (funcall (cdr image-data-link) protocol link description)))
             (<span class="org-keyword">when</span> image-data
               (<span class="org-keyword">let</span> ((ol (org-image-update-overlay image-data el t t)))
                 (<span class="org-keyword">when</span> (<span class="org-keyword">and</span> ol description)
                   (overlay-put ol 'after-string description)))))))))))

(<span class="org-keyword">defun</span> <span class="org-function-name">org-remoteimg--fetch-image</span> (protocol link _description)
  <span class="org-doc">"Synchronously retrieve image from cache or web."</span>
  (<span class="org-keyword">when</span> (<span class="org-keyword">and</span> (image-supported-file-p link)
             (not (eq org-display-remote-inline-images 'skip)))
    (<span class="org-keyword">let*</span> ((cache (eq org-display-remote-inline-images 'cache))
           (url-automatic-caching (<span class="org-keyword">if</span> cache
                                      t
                                    url-automatic-caching))
           (url (concat protocol <span class="org-string">":"</span> link))
           (silent-output (file-exists-p (url-cache-create-filename url))))
      (<span class="org-keyword">if-let*</span> ((buf (url-retrieve-synchronously url
                                                   silent-output
                                                   nil
                                                   30)))
              (<span class="org-keyword">with-current-buffer</span> buf
                (goto-char (point-min))
                (re-search-forward <span class="org-string">"\r?\n\r?\n"</span> nil t)
                (buffer-substring-no-properties (point) (point-max)))
            (<span class="org-warning">error</span> <span class="org-string">"Download of image \"%s\" failed"</span> link)
            nil))))

(<span class="org-keyword">defun</span> <span class="org-function-name">org-link-preview-http</span> (ov _path link)
  <span class="org-doc">"Generate preview OV for LINK in PATH."</span>
  (<span class="org-keyword">when-let*</span> ((raw-link (org-element-property <span class="org-builtin">:raw-link</span> link))
              (image-type (image-supported-file-p raw-link))
              <span class="org-comment-delimiter">;; </span><span class="org-comment">cache?
</span>              (image-buffer (org-remoteimg--fetch-image nil raw-link nil)))
        (overlay-put ov 'display (create-image image-buffer
                                      <span class="org-comment-delimiter">;; </span><span class="org-comment">scale?
</span>                                   <span class="org-comment-delimiter">;; </span><span class="org-comment">(and (image-type-available-p 'imagemagick)
</span>                                   <span class="org-comment-delimiter">;;      </span><span class="org-comment">width
</span>                                   <span class="org-comment-delimiter">;;      </span><span class="org-comment">'imagemagick)
</span>                                                             <span class="org-comment-delimiter">;; </span><span class="org-comment">:width width
</span>                                                             image-type
                                                             t))
        t))

(<span class="org-keyword">if</span> (fboundp 'org-display-inline-images)
    (<span class="org-keyword">progn</span>
      (advice-add #'org-display-inline-images <span class="org-builtin">:after</span> #'org-display-user-inline-images)
      (org-link-set-parameters <span class="org-string">"http"</span>  <span class="org-builtin">:image-data-fun</span> #'org-remoteimg--fetch-image)
      (org-link-set-parameters <span class="org-string">"https"</span> <span class="org-builtin">:image-data-fun</span> #'org-remoteimg--fetch-image))
  (org-link-set-parameters <span class="org-string">"http"</span> <span class="org-builtin">:preview</span> #'org-link-preview-http)
  (org-link-set-parameters <span class="org-string">"https"</span> <span class="org-builtin">:preview</span> #'org-link-preview-http))

(<span class="org-keyword">provide</span> '<span class="org-constant">org-remoteimg</span>)

<span class="org-comment-delimiter">;;; </span><span class="org-comment">org-remoteimg.el ends here
</span>
</pre>
</div>
</div>
</div>
