content/emacs/configs/07-org.org
* Org-Roam Configuration

Org-roam is a powerful Zettelkasten-style note-taking system built on top of Org-mode. It enables networked thought through bidirectional linking and provides tools for knowledge management inspired by Roam Research.

** Core Setup

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/org-conf.el
  (use-package org-roam
    :after org
    :demand t
    :custom
    ;; Directory where all your notes will be stored
    (org-roam-directory (file-truename "~/org-roam/"))

    ;; Better database location (avoid cluttering org-roam directory)
    (org-roam-db-location (expand-file-name "org-roam.db" user-emacs-directory))

    ;; Enable completion everywhere (for inserting links)
    (org-roam-completion-everywhere t)

    ;; Configure how nodes are displayed in completion
    (org-roam-node-display-template
     (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))

    :bind
    (("C-c n l" . org-roam-buffer-toggle)         ;; Show backlinks sidebar
     ("C-c n f" . org-roam-node-find)             ;; Find or create a note
     ("C-c n i" . org-roam-node-insert)           ;; Insert a link to a note
     ("C-c n c" . org-roam-capture)               ;; Quick capture
     ("C-c n j" . org-roam-dailies-capture-today) ;; Daily note
     ("C-c n g" . org-roam-graph)                 ;; Visualize the graph
     :map org-mode-map
     ("C-M-i"   . completion-at-point))           ;; Complete link at point

    :config
    ;; Initialize org-roam database and sync on startup
    (org-roam-db-autosync-mode 1)

    ;; Ensure org-roam directory exists
    (unless (file-directory-p org-roam-directory)
      (make-directory org-roam-directory t)))
#+end_src

** Capture Templates

Define templates for different types of notes. This follows the best practice of having different note types (fleeting, permanent, literature, etc.).

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/org-conf.el
  (use-package org-roam
    :custom
    ;; Capture templates for different note types
    (org-roam-capture-templates
     '(("d" "default" plain
        "%?"
        :target (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                           "#+title: ${title}\n#+date: %U\n#+filetags: \n\n")
        :unnarrowed t)

       ("p" "permanent" plain
        "* Source\n\n%?\n\n* Content\n\n\n* Links\n"
        :target (file+head "permanent/%<%Y%m%d%H%M%S>-${slug}.org"
                           "#+title: ${title}\n#+date: %U\n#+filetags: :permanent:\n\n")
        :unnarrowed t)

       ("l" "literature" plain
        "* Source\n\nAuthor: %^{Author}\nTitle: ${title}\nYear: %^{Year}\n\n%?\n\n* Summary\n\n\n* Key Points\n\n\n* Quotes\n\n\n* Related\n"
        :target (file+head "literature/%<%Y%m%d%H%M%S>-${slug}.org"
                           "#+title: ${title}\n#+date: %U\n#+filetags: :literature:\n\n")
        :unnarrowed t)

       ("c" "concept" plain
        "* Definition\n\n%?\n\n* Examples\n\n\n* Related Concepts\n"
        :target (file+head "concepts/%<%Y%m%d%H%M%S>-${slug}.org"
                           "#+title: ${title}\n#+date: %U\n#+filetags: :concept:\n\n")
        :unnarrowed t)

       ("r" "reference" plain
        "* %?\n"
        :target (file+head "reference/%<%Y%m%d%H%M%S>-${slug}.org"
                           "#+title: ${title}\n#+date: %U\n#+filetags: :reference:\n\n")
        :unnarrowed t))))
#+end_src

** Daily Notes Configuration

Daily notes are essential for journaling and capturing fleeting thoughts. This configuration follows best practices for daily note organization.

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/org-conf.el
  (use-package org-roam
    :custom
    ;; Store daily notes in a dedicated subdirectory
    (org-roam-dailies-directory "daily/")

    ;; Capture templates for daily notes
    (org-roam-dailies-capture-templates
     '(("d" "default" entry
        "* %<%H:%M> %?"
        :target (file+head "%<%Y-%m-%d>.org"
                           "#+title: %<%Y-%m-%d (%A)>\n#+filetags: :daily:\n\n"))

       ("m" "meeting" entry
        "* %<%H:%M> Meeting: %^{Meeting Title}\n\n** Attendees\n%?\n\n** Notes\n\n\n** Action Items\n"
        :target (file+head "%<%Y-%m-%d>.org"
                           "#+title: %<%Y-%m-%d (%A)>\n#+filetags: :daily:\n\n"))

       ("j" "journal" entry
        "* %<%H:%M> Journal\n\n%?"
        :target (file+head "%<%Y-%m-%d>.org"
                           "#+title: %<%Y-%m-%d (%A)>\n#+filetags: :daily:journal:\n\n"))

       ("t" "task" entry
        "* TODO %?\n  SCHEDULED: %t\n"
        :target (file+head "%<%Y-%m-%d>.org"
                           "#+title: %<%Y-%m-%d (%A)>\n#+filetags: :daily:\n\n"))))

    :bind
    (("C-c n t" . org-roam-dailies-goto-today)
     ("C-c n y" . org-roam-dailies-goto-yesterday)
     ("C-c n d" . org-roam-dailies-goto-date)
     ("C-c n n" . org-roam-dailies-goto-next-note)
     ("C-c n p" . org-roam-dailies-goto-previous-note)))
#+end_src

