emacs/configs/07-org.html

<div id="outline-container-orga6d62b8" class="outline-2">
<h2 id="orga6d62b8"><span class="section-number-2">6.</span> Org-Roam Configuration</h2>
<div class="outline-text-2" id="text-6">
<p>
Org-roam is a powerful Zettelkasten-style note-taking system built on top of Org-mode. It enables networked thought through bidirectional linking and provides tools for knowledge management inspired by Roam Research.
</p>
</div>

<div id="outline-container-org11a3dbe" class="outline-3">
<h3 id="org11a3dbe"><span class="section-number-3">6.1.</span> Core Setup</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> org-roam
  <span class="org-builtin">:after</span> org
  <span class="org-builtin">:demand</span> t
  <span class="org-builtin">:custom</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Directory where all your notes will be stored
</span>  (org-roam-directory (file-truename <span class="org-string">"~/org-roam/"</span>))

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Better database location (avoid cluttering org-roam directory)
</span>  (org-roam-db-location (expand-file-name <span class="org-string">"org-roam.db"</span> user-emacs-directory))

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Enable completion everywhere (for inserting links)
</span>  (org-roam-completion-everywhere t)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Configure how nodes are displayed in completion
</span>  (org-roam-node-display-template
   (concat <span class="org-string">"${title:*} "</span> (propertize <span class="org-string">"${tags:10}"</span> 'face 'org-tag)))

  <span class="org-builtin">:bind</span>
  ((<span class="org-string">"C-c n l"</span> . org-roam-buffer-toggle)         <span class="org-comment-delimiter">;; </span><span class="org-comment">Show backlinks sidebar
</span>   (<span class="org-string">"C-c n f"</span> . org-roam-node-find)             <span class="org-comment-delimiter">;; </span><span class="org-comment">Find or create a note
</span>   (<span class="org-string">"C-c n i"</span> . org-roam-node-insert)           <span class="org-comment-delimiter">;; </span><span class="org-comment">Insert a link to a note
</span>   (<span class="org-string">"C-c n c"</span> . org-roam-capture)               <span class="org-comment-delimiter">;; </span><span class="org-comment">Quick capture
</span>   (<span class="org-string">"C-c n j"</span> . org-roam-dailies-capture-today) <span class="org-comment-delimiter">;; </span><span class="org-comment">Daily note
</span>   (<span class="org-string">"C-c n g"</span> . org-roam-graph)                 <span class="org-comment-delimiter">;; </span><span class="org-comment">Visualize the graph
</span>   <span class="org-builtin">:map</span> org-mode-map
   (<span class="org-string">"C-M-i"</span>   . completion-at-point))           <span class="org-comment-delimiter">;; </span><span class="org-comment">Complete link at point
</span>
  <span class="org-builtin">:config</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Initialize org-roam database and sync on startup
</span>  (org-roam-db-autosync-mode 1)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Ensure org-roam directory exists
</span>  (<span class="org-keyword">unless</span> (file-directory-p org-roam-directory)
    (make-directory org-roam-directory t)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org4305839" class="outline-3">
<h3 id="org4305839"><span class="section-number-3">6.2.</span> Capture Templates</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Define templates for different types of notes. This follows the best practice of having different note types (fleeting, permanent, literature, etc.).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> org-roam
  <span class="org-builtin">:custom</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Capture templates for different note types
</span>  (org-roam-capture-templates
   '((<span class="org-string">"d"</span> <span class="org-string">"default"</span> plain
      <span class="org-string">"%?"</span>
      <span class="org-builtin">:target</span> (file+head <span class="org-string">"%&lt;%Y%m%d%H%M%S&gt;-${slug}.org"</span>
                         <span class="org-string">"#+title: ${title}\n#+date: %U\n#+filetags: \n\n"</span>)
      <span class="org-builtin">:unnarrowed</span> t)

     (<span class="org-string">"p"</span> <span class="org-string">"permanent"</span> plain
      <span class="org-string">"* Source\n\n%?\n\n* Content\n\n\n* Links\n"</span>
      <span class="org-builtin">:target</span> (file+head <span class="org-string">"permanent/%&lt;%Y%m%d%H%M%S&gt;-${slug}.org"</span>
                         <span class="org-string">"#+title: ${title}\n#+date: %U\n#+filetags: :permanent:\n\n"</span>)
      <span class="org-builtin">:unnarrowed</span> t)

     (<span class="org-string">"l"</span> <span class="org-string">"literature"</span> plain
      <span class="org-string">"* Source\n\nAuthor: %^{Author}\nTitle: ${title}\nYear: %^{Year}\n\n%?\n\n* Summary\n\n\n* Key Points\n\n\n* Quotes\n\n\n* Related\n"</span>
      <span class="org-builtin">:target</span> (file+head <span class="org-string">"literature/%&lt;%Y%m%d%H%M%S&gt;-${slug}.org"</span>
                         <span class="org-string">"#+title: ${title}\n#+date: %U\n#+filetags: :literature:\n\n"</span>)
      <span class="org-builtin">:unnarrowed</span> t)

     (<span class="org-string">"c"</span> <span class="org-string">"concept"</span> plain
      <span class="org-string">"* Definition\n\n%?\n\n* Examples\n\n\n* Related Concepts\n"</span>
      <span class="org-builtin">:target</span> (file+head <span class="org-string">"concepts/%&lt;%Y%m%d%H%M%S&gt;-${slug}.org"</span>
                         <span class="org-string">"#+title: ${title}\n#+date: %U\n#+filetags: :concept:\n\n"</span>)
      <span class="org-builtin">:unnarrowed</span> t)

     (<span class="org-string">"r"</span> <span class="org-string">"reference"</span> plain
      <span class="org-string">"* %?\n"</span>
      <span class="org-builtin">:target</span> (file+head <span class="org-string">"reference/%&lt;%Y%m%d%H%M%S&gt;-${slug}.org"</span>
                         <span class="org-string">"#+title: ${title}\n#+date: %U\n#+filetags: :reference:\n\n"</span>)
      <span class="org-builtin">:unnarrowed</span> t))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaff762a" class="outline-3">
<h3 id="orgaff762a"><span class="section-number-3">6.3.</span> Daily Notes Configuration</h3>
<div class="outline-text-3" id="text-6-3">
<p>
Daily notes are essential for journaling and capturing fleeting thoughts. This configuration follows best practices for daily note organization.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> org-roam
  <span class="org-builtin">:custom</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Store daily notes in a dedicated subdirectory
</span>  (org-roam-dailies-directory <span class="org-string">"daily/"</span>)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Capture templates for daily notes
</span>  (org-roam-dailies-capture-templates
   '((<span class="org-string">"d"</span> <span class="org-string">"default"</span> entry
      <span class="org-string">"* %&lt;%H:%M&gt; %?"</span>
      <span class="org-builtin">:target</span> (file+head <span class="org-string">"%&lt;%Y-%m-%d&gt;.org"</span>
                         <span class="org-string">"#+title: %&lt;%Y-%m-%d (%A)&gt;\n#+filetags: :daily:\n\n"</span>))

     (<span class="org-string">"m"</span> <span class="org-string">"meeting"</span> entry
      <span class="org-string">"* %&lt;%H:%M&gt; Meeting: %^{Meeting Title}\n\n** Attendees\n%?\n\n** Notes\n\n\n** Action Items\n"</span>
      <span class="org-builtin">:target</span> (file+head <span class="org-string">"%&lt;%Y-%m-%d&gt;.org"</span>
                         <span class="org-string">"#+title: %&lt;%Y-%m-%d (%A)&gt;\n#+filetags: :daily:\n\n"</span>))

     (<span class="org-string">"j"</span> <span class="org-string">"journal"</span> entry
      <span class="org-string">"* %&lt;%H:%M&gt; Journal\n\n%?"</span>
      <span class="org-builtin">:target</span> (file+head <span class="org-string">"%&lt;%Y-%m-%d&gt;.org"</span>
                         <span class="org-string">"#+title: %&lt;%Y-%m-%d (%A)&gt;\n#+filetags: :daily:journal:\n\n"</span>))

     (<span class="org-string">"t"</span> <span class="org-string">"task"</span> entry
      <span class="org-string">"* TODO %?\n  SCHEDULED: %t\n"</span>
      <span class="org-builtin">:target</span> (file+head <span class="org-string">"%&lt;%Y-%m-%d&gt;.org"</span>
                         <span class="org-string">"#+title: %&lt;%Y-%m-%d (%A)&gt;\n#+filetags: :daily:\n\n"</span>))))

  <span class="org-builtin">:bind</span>
  ((<span class="org-string">"C-c n t"</span> . org-roam-dailies-goto-today)
   (<span class="org-string">"C-c n y"</span> . org-roam-dailies-goto-yesterday)
   (<span class="org-string">"C-c n d"</span> . org-roam-dailies-goto-date)
   (<span class="org-string">"C-c n n"</span> . org-roam-dailies-goto-next-note)
   (<span class="org-string">"C-c n p"</span> . org-roam-dailies-goto-previous-note)))
</pre>
</div>
</div>
</div>
