content/emacs/configs/07-org.org
** Enhanced Node Display

Customize how nodes appear in completion and searches for better usability.

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/org-conf.el
  (use-package org-roam
    :config
    ;; Custom function to display nodes with more context
    (setq org-roam-node-display-template
          (concat "${type:15} ${title:*} " (propertize "${tags:20}" 'face 'org-tag)))

    ;; Add custom properties to node display
    (cl-defmethod org-roam-node-type ((node org-roam-node))
      "Return the TYPE of NODE based on tags or directory."
      (let ((tags (org-roam-node-tags node))
            (file (org-roam-node-file node)))
        (cond
         ((member "permanent" tags) "📝 Permanent")
         ((member "literature" tags) "📚 Literature")
         ((member "concept" tags) "💡 Concept")
         ((member "reference" tags) "📖 Reference")
         ((member "daily" tags) "📅 Daily")
         ((string-match-p "/daily/" file) "📅 Daily")
         ((string-match-p "/literature/" file) "📚 Literature")
         ((string-match-p "/permanent/" file) "📝 Permanent")
         ((string-match-p "/concepts/" file) "💡 Concept")
         (t "📄 Note")))))
#+end_src

** Graph Visualization

Configure org-roam's graph visualization for better insights into your knowledge network.

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/org-conf.el
  (use-package org-roam
    :custom
    ;; Graphviz executable for generating graphs
    (org-roam-graph-executable (executable-find "dot"))

    ;; Exclude certain tags from the graph for cleaner visualization
    (org-roam-graph-exclude-matcher '("daily" "fleeting"))

    ;; Use specific program for graph generation
    (org-roam-graph-viewer (executable-find "open"))  ;; macOS
    ;; For Linux: (org-roam-graph-viewer "xdg-open")
    ;; For Windows: (org-roam-graph-viewer "start")

    ;; Additional graph settings
    (org-roam-graph-extra-config
     '(("overlap" . "false")
       ("splines" . "true")
       ("rankdir" . "LR"))))  ;; Left to Right layout
#+end_src

** UI Enhancement with org-roam-ui

Optional web-based graph visualization interface (requires separate package).

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/org-conf.el
  (use-package org-roam-ui
    :after org-roam
    :custom
    (org-roam-ui-sync-theme t)              ;; Sync with Emacs theme
    (org-roam-ui-follow t)                  ;; Follow current note in UI
    (org-roam-ui-update-on-save t)          ;; Update graph on save
    (org-roam-ui-open-on-start t)           ;; Open browser when activated
    (org-roam-ui-browser-function #'browse-url-default-browser)  ;; Use default browser
    :bind
    ("C-c n u" . org-roam-ui-mode))
#+end_src

** Performance Optimizations

Best practices for maintaining good performance with large note collections.

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/org-conf.el
  (use-package org-roam
    :custom
    ;; Increase cache size for better performance
    (org-roam-db-gc-threshold most-positive-fixnum)

    ;; Update database asynchronously
    (org-roam-db-update-method 'immediate)

    :config
    ;; Auto-save database periodically
    (run-with-idle-timer 300 t #'org-roam-db-sync))

  ;; Helper function for safe note deletion
  (defun fu/org-roam-node-delete (&optional node)
    "Delete an org-roam NODE after showing backlinks warning.
If NODE is not provided, prompt to select a note from minibuffer.
If called from within a note, can use current note."
    (interactive)
    (let* ((node (or node
                     (if (derived-mode-p 'org-mode)
                         ;; Try current node first, fall back to selection
                         (or (org-roam-node-at-point)
                             (org-roam-node-read))
                       ;; Not in org-mode, always prompt
                       (org-roam-node-read))))
           (file (org-roam-node-file node))
           (title (org-roam-node-title node))
           (backlinks (org-roam-backlinks-get node))
           (buffer (find-buffer-visiting file)))
      (if backlinks
          (progn
            ;; Open the file if not already open
            (unless buffer
              (find-file file))
            (org-roam-buffer-toggle)
            (message "WARNING: %d notes link to '%s'! Check backlinks first."
                     (length backlinks) title))
        (when (yes-or-no-p (format "Delete '%s'? " title))
          (when buffer (kill-buffer buffer))
          (delete-file file)
          (org-roam-db-sync)
          (message "Note '%s' deleted and database synced." title)))))

  (provide 'org-conf)
  ;;; org-conf.el ends here
#+end_src

