emacs/configs/07-org.html

<div id="outline-container-org1493c3f" class="outline-3">
<h3 id="org1493c3f"><span class="section-number-3">6.4.</span> Enhanced Node Display</h3>
<div class="outline-text-3" id="text-6-4">
<p>
Customize how nodes appear in completion and searches for better usability.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> org-roam
  <span class="org-builtin">:config</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Custom function to display nodes with more context
</span>  (<span class="org-keyword">setq</span> org-roam-node-display-template
        (concat <span class="org-string">"${type:15} ${title:*} "</span> (propertize <span class="org-string">"${tags:20}"</span> 'face 'org-tag)))

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Add custom properties to node display
</span>  (<span class="org-keyword">cl-defmethod</span> <span class="org-function-name">org-roam-node-type</span> ((node org-roam-node))
    <span class="org-doc">"Return the TYPE of NODE based on tags or directory."</span>
    (<span class="org-keyword">let</span> ((tags (org-roam-node-tags node))
          (file (org-roam-node-file node)))
      (<span class="org-keyword">cond</span>
       ((member <span class="org-string">"permanent"</span> tags) <span class="org-string">"&#128221; Permanent"</span>)
       ((member <span class="org-string">"literature"</span> tags) <span class="org-string">"&#128218; Literature"</span>)
       ((member <span class="org-string">"concept"</span> tags) <span class="org-string">"&#128161; Concept"</span>)
       ((member <span class="org-string">"reference"</span> tags) <span class="org-string">"&#128214; Reference"</span>)
       ((member <span class="org-string">"daily"</span> tags) <span class="org-string">"&#128197; Daily"</span>)
       ((string-match-p <span class="org-string">"/daily/"</span> file) <span class="org-string">"&#128197; Daily"</span>)
       ((string-match-p <span class="org-string">"/literature/"</span> file) <span class="org-string">"&#128218; Literature"</span>)
       ((string-match-p <span class="org-string">"/permanent/"</span> file) <span class="org-string">"&#128221; Permanent"</span>)
       ((string-match-p <span class="org-string">"/concepts/"</span> file) <span class="org-string">"&#128161; Concept"</span>)
       (t <span class="org-string">"&#128196; Note"</span>)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc561522" class="outline-3">
<h3 id="orgc561522"><span class="section-number-3">6.5.</span> Graph Visualization</h3>
<div class="outline-text-3" id="text-6-5">
<p>
Configure org-roam's graph visualization for better insights into your knowledge network.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> org-roam
  <span class="org-builtin">:custom</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Graphviz executable for generating graphs
</span>  (org-roam-graph-executable (executable-find <span class="org-string">"dot"</span>))

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Exclude certain tags from the graph for cleaner visualization
</span>  (org-roam-graph-exclude-matcher '(<span class="org-string">"daily"</span> <span class="org-string">"fleeting"</span>))

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Use specific program for graph generation
</span>  (org-roam-graph-viewer (executable-find <span class="org-string">"open"</span>))  <span class="org-comment-delimiter">;; </span><span class="org-comment">macOS
</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">For Linux: (org-roam-graph-viewer "xdg-open")
</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">For Windows: (org-roam-graph-viewer "start")
</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Additional graph settings
</span>  (org-roam-graph-extra-config
   '((<span class="org-string">"overlap"</span> . <span class="org-string">"false"</span>)
     (<span class="org-string">"splines"</span> . <span class="org-string">"true"</span>)
     (<span class="org-string">"rankdir"</span> . <span class="org-string">"LR"</span>))))  <span class="org-comment-delimiter">;; </span><span class="org-comment">Left to Right layout</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge8c0c43" class="outline-3">
<h3 id="orge8c0c43"><span class="section-number-3">6.6.</span> UI Enhancement with org-roam-ui</h3>
<div class="outline-text-3" id="text-6-6">
<p>
Optional web-based graph visualization interface (requires separate package).
Automatically skipped on server/headless environments.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Skip org-roam-ui on server (requires browser/GUI)
</span>(<span class="org-keyword">unless</span> emacs-server-mode
  (<span class="org-keyword">use-package</span> org-roam-ui
    <span class="org-builtin">:after</span> org-roam
    <span class="org-builtin">:custom</span>
    (org-roam-ui-sync-theme t)              <span class="org-comment-delimiter">;; </span><span class="org-comment">Sync with Emacs theme
</span>    (org-roam-ui-follow t)                  <span class="org-comment-delimiter">;; </span><span class="org-comment">Follow current note in UI
</span>    (org-roam-ui-update-on-save t)          <span class="org-comment-delimiter">;; </span><span class="org-comment">Update graph on save
</span>    (org-roam-ui-open-on-start t)           <span class="org-comment-delimiter">;; </span><span class="org-comment">Open browser when activated
</span>    (org-roam-ui-browser-function #'browse-url-default-browser)  <span class="org-comment-delimiter">;; </span><span class="org-comment">Use default browser
</span>    <span class="org-builtin">:bind</span>
    (<span class="org-string">"C-c n u"</span> . org-roam-ui-mode)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfd06c26" class="outline-3">
<h3 id="orgfd06c26"><span class="section-number-3">6.7.</span> Performance Optimizations</h3>
<div class="outline-text-3" id="text-6-7">
<p>
Best practices for maintaining good performance with large note collections.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">  (<span class="org-keyword">use-package</span> org-roam
    <span class="org-builtin">:custom</span>
    <span class="org-comment-delimiter">;; </span><span class="org-comment">Increase cache size for better performance
</span>    (org-roam-db-gc-threshold most-positive-fixnum)

    <span class="org-comment-delimiter">;; </span><span class="org-comment">Update database asynchronously
</span>    (org-roam-db-update-method 'immediate)

    <span class="org-builtin">:config</span>
    <span class="org-comment-delimiter">;; </span><span class="org-comment">Auto-save database periodically
</span>    (run-with-idle-timer 300 t #'org-roam-db-sync))

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Helper function for safe note deletion
</span>  (<span class="org-keyword">defun</span> <span class="org-function-name">fu/org-roam-node-delete</span> (<span class="org-type">&amp;optional</span> node)
    <span class="org-doc">"Delete an org-roam NODE after showing backlinks warning.
If NODE is not provided, prompt to select a note from minibuffer.
If called from within a note, can use current note."</span>
    (<span class="org-keyword">interactive</span>)
    (<span class="org-keyword">let*</span> ((node (<span class="org-keyword">or</span> node
                     (<span class="org-keyword">if</span> (derived-mode-p 'org-mode)
                         <span class="org-comment-delimiter">;; </span><span class="org-comment">Try current node first, fall back to selection
</span>                         (<span class="org-keyword">or</span> (org-roam-node-at-point)
                             (org-roam-node-read))
                       <span class="org-comment-delimiter">;; </span><span class="org-comment">Not in org-mode, always prompt
</span>                       (org-roam-node-read))))
           (file (org-roam-node-file node))
           (title (org-roam-node-title node))
           (backlinks (org-roam-backlinks-get node))
           (buffer (find-buffer-visiting file)))
      (<span class="org-keyword">if</span> backlinks
          (<span class="org-keyword">progn</span>
            <span class="org-comment-delimiter">;; </span><span class="org-comment">Open the file if not already open
</span>            (<span class="org-keyword">unless</span> buffer
              (find-file file))
            (org-roam-buffer-toggle)
            (message <span class="org-string">"WARNING: %d notes link to '</span><span class="org-string"><span class="org-constant">%s</span></span><span class="org-string">'! Check backlinks first."</span>
                     (length backlinks) title))
        (<span class="org-keyword">when</span> (yes-or-no-p (format <span class="org-string">"Delete '</span><span class="org-string"><span class="org-constant">%s</span></span><span class="org-string">'? "</span> title))
          (<span class="org-keyword">when</span> buffer (kill-buffer buffer))
          (delete-file file)
          (org-roam-db-sync)
          (message <span class="org-string">"Note '</span><span class="org-string"><span class="org-constant">%s</span></span><span class="org-string">' deleted and database synced."</span> title)))))

  (<span class="org-keyword">provide</span> '<span class="org-constant">org-conf</span>)
  <span class="org-comment-delimiter">;;; </span><span class="org-comment">org-conf.el ends here</span>
</pre>
</div>
</div>
</div>
