content/emacs/configs/07-org.org
** Best Practices Summary

Key principles to follow when using org-roam:

1. *Atomic Notes*: One idea per note - keeps notes focused and linkable
2. *Consistent Tagging*: Use tags systematically (e.g., =:permanent:=, =:literature:=, =:concept:=)
3. *Regular Capturing*: Use daily notes to capture fleeting thoughts immediately
4. *Link Liberally*: Create connections between notes to build your knowledge graph
5. *Regular Reviews*: Periodically review and refactor notes to strengthen connections
6. *Structured Templates*: Use capture templates to maintain consistency
7. *Hierarchical Organization*: Use subdirectories (daily/, literature/, etc.) for better organization
8. *Database Maintenance*: Let org-roam-db-autosync-mode handle synchronization automatically
9. *Safe Deletion*: Always check backlinks before deleting notes to avoid orphaned links

** Common Workflows

*** Creating a New Note
1. =C-c n f= (org-roam-node-find)
2. Type the note title
3. Select template (or use default)
4. Write your note with =[[links]]= to other notes

*** Linking Notes
1. =C-c n i= (org-roam-node-insert) while writing
2. Search for existing note or create new one
3. Link is created bidirectionally

*** Daily Journaling
1. =C-c n j= (org-roam-dailies-capture-today)
2. Select template (journal, meeting, task, etc.)
3. Write entry - automatically timestamped

*** Reviewing Connections
1. =C-c n l= (org-roam-buffer-toggle) to see backlinks
2. =C-c n g= (org-roam-graph) for visual exploration
3. =C-c n u= (org-roam-ui-mode) for interactive web interface

*** Deleting Notes Safely

*Method 1: Delete from anywhere (recommended)*
1. =M-x fu/org-roam-node-delete= from any buffer
2. Select the note to delete from minibuffer (with completion)
3. If backlinks exist, the note opens and backlinks sidebar shows warning
4. Check each linking note and update/remove links
5. Run the command again to confirm deletion
6. Database automatically syncs after deletion

*Method 2: Delete current note*
1. Open the note you want to delete
2. =M-x fu/org-roam-node-delete= (automatically uses current note)
3. Follow steps 3-6 from Method 1

*Alternative manual method:*
1. =C-c n l= to check backlinks first
2. Update all linking notes
3. Delete the file normally
4. =M-x org-roam-db-sync= to clean up the database

* Remote Access Setup

This section covers how to access org-roam from anywhere using cloud servers (AWS EC2, VPS, etc.) instead of Notion or Obsidian.

** Overview of Remote Access Approaches

| Approach        | Pros                            | Cons             | Best For                  |
|-----------------+---------------------------------+------------------+---------------------------|
| SSH + Mosh      | Low latency, no sync conflicts  | Requires network | Primary remote workflow   |
| org-roam-ui Web | Mobile-friendly, visual         | Read-only        | Browsing on mobile        |
| Git Sync        | Offline access, version control | Manual conflicts | Multiple devices          |
| TRAMP           | Use local Emacs                 | Some lag         | Occasional remote editing |

** AWS EC2 / VPS Setup Guide

*** Initial Server Setup

*Prerequisites:*
- AWS account or any VPS provider (DigitalOcean, Linode, etc.)
- SSH key pair configured

*Launch Instance:*
#+begin_src shell
# Recommended specs:
# - t2.micro or t3.micro (AWS free tier)
# - Ubuntu 24.04 LTS
# - 1GB RAM minimum, 20GB disk
# - Security group: SSH (22), Mosh (60000-61000 UDP), optional HTTP (8080)
#+end_src

*Install dependencies on server:*
#+begin_src shell
sudo apt update && sudo apt install -y \
  emacs-nox \
  tmux \
  mosh \
  sqlite3 \
  ripgrep \
  git \
  build-essential
#+end_src

*** Transfer Org-Roam Files

*Option 1: Git (recommended)*
#+begin_src shell
# On local machine - push org-roam to Git
cd ~/org-roam
git init
echo "org-roam.db" >> .gitignore  # IMPORTANT: Never sync database!
git add .
git commit -m "Initial org-roam commit"
git remote add origin <your-repo-url>
git push -u origin main

# On EC2 server - clone repository
git clone <your-repo-url> ~/org-roam
#+end_src

*Option 2: SCP (one-time copy)*
#+begin_src shell
# Copy from local to server (excludes database)
rsync -avz --exclude='org-roam.db' ~/org-roam/ user@ec2-ip:~/org-roam/
#+end_src

*** Configure Emacs on Server

*Transfer your Emacs configuration:*
#+begin_src shell
# Option 1: If using this repository
cd ~/Projects/mandoo180.github.io
git push
# Then on server:
git clone <this-repo-url>
cd mandoo180.github.io
./tangle.sh

# Option 2: Copy specific config
scp -r ~/.emacs.d/elisp/settings/org-conf.el user@ec2-ip:~/.emacs.d/elisp/settings/
#+end_src

*Start Emacs daemon:*
#+begin_src shell
# On server
emacs --daemon
#+end_src

