emacs/configs/07-org.html

<div id="outline-container-org17db810" class="outline-3">
<h3 id="org17db810"><span class="section-number-3">6.8.</span> Best Practices Summary</h3>
<div class="outline-text-3" id="text-6-8">
<p>
Key principles to follow when using org-roam:
</p>

<ol class="org-ol">
<li><b>Atomic Notes</b>: One idea per note - keeps notes focused and linkable</li>
<li><b>Consistent Tagging</b>: Use tags systematically (e.g., <code>:permanent:</code>, <code>:literature:</code>, <code>:concept:</code>)</li>
<li><b>Regular Capturing</b>: Use daily notes to capture fleeting thoughts immediately</li>
<li><b>Link Liberally</b>: Create connections between notes to build your knowledge graph</li>
<li><b>Regular Reviews</b>: Periodically review and refactor notes to strengthen connections</li>
<li><b>Structured Templates</b>: Use capture templates to maintain consistency</li>
<li><b>Hierarchical Organization</b>: Use subdirectories (daily/, literature/, etc.) for better organization</li>
<li><b>Database Maintenance</b>: Let org-roam-db-autosync-mode handle synchronization automatically</li>
<li><b>Safe Deletion</b>: Always check backlinks before deleting notes to avoid orphaned links</li>
</ol>
</div>
</div>

<div id="outline-container-orgbf36e2e" class="outline-3">
<h3 id="orgbf36e2e"><span class="section-number-3">6.9.</span> Common Workflows</h3>
<div class="outline-text-3" id="text-6-9">
</div>
<div id="outline-container-org53afa5f" class="outline-4">
<h4 id="org53afa5f"><span class="section-number-4">6.9.1.</span> Creating a New Note</h4>
<div class="outline-text-4" id="text-6-9-1">
<ol class="org-ol">
<li><code>C-c n f</code> (org-roam-node-find)</li>
<li>Type the note title</li>
<li>Select template (or use default)</li>
<li>Write your note with <code>[[links]]</code> to other notes</li>
</ol>
</div>
</div>

<div id="outline-container-org5a3ec04" class="outline-4">
<h4 id="org5a3ec04"><span class="section-number-4">6.9.2.</span> Linking Notes</h4>
<div class="outline-text-4" id="text-6-9-2">
<ol class="org-ol">
<li><code>C-c n i</code> (org-roam-node-insert) while writing</li>
<li>Search for existing note or create new one</li>
<li>Link is created bidirectionally</li>
</ol>
</div>
</div>

<div id="outline-container-org75fbbc6" class="outline-4">
<h4 id="org75fbbc6"><span class="section-number-4">6.9.3.</span> Daily Journaling</h4>
<div class="outline-text-4" id="text-6-9-3">
<ol class="org-ol">
<li><code>C-c n j</code> (org-roam-dailies-capture-today)</li>
<li>Select template (journal, meeting, task, etc.)</li>
<li>Write entry - automatically timestamped</li>
</ol>
</div>
</div>

<div id="outline-container-org5e81fa0" class="outline-4">
<h4 id="org5e81fa0"><span class="section-number-4">6.9.4.</span> Reviewing Connections</h4>
<div class="outline-text-4" id="text-6-9-4">
<ol class="org-ol">
<li><code>C-c n l</code> (org-roam-buffer-toggle) to see backlinks</li>
<li><code>C-c n g</code> (org-roam-graph) for visual exploration</li>
<li><code>C-c n u</code> (org-roam-ui-mode) for interactive web interface</li>
</ol>
</div>
</div>

<div id="outline-container-orgd445a04" class="outline-4">
<h4 id="orgd445a04"><span class="section-number-4">6.9.5.</span> Deleting Notes Safely</h4>
<div class="outline-text-4" id="text-6-9-5">
<p>
<b>Method 1: Delete from anywhere (recommended)</b>
</p>
<ol class="org-ol">
<li><code>M-x fu/org-roam-node-delete</code> from any buffer</li>
<li>Select the note to delete from minibuffer (with completion)</li>
<li>If backlinks exist, the note opens and backlinks sidebar shows warning</li>
<li>Check each linking note and update/remove links</li>
<li>Run the command again to confirm deletion</li>
<li>Database automatically syncs after deletion</li>
</ol>

<p>
<b>Method 2: Delete current note</b>
</p>
<ol class="org-ol">
<li>Open the note you want to delete</li>
<li><code>M-x fu/org-roam-node-delete</code> (automatically uses current note)</li>
<li>Follow steps 3-6 from Method 1</li>
</ol>

<p>
<b>Alternative manual method:</b>
</p>
<ol class="org-ol">
<li><code>C-c n l</code> to check backlinks first</li>
<li>Update all linking notes</li>
<li>Delete the file normally</li>
<li><code>M-x org-roam-db-sync</code> to clean up the database</li>
</ol>
</div>
</div>
</div>
</div>

<div id="outline-container-org80286e9" class="outline-2">
<h2 id="org80286e9"><span class="section-number-2">7.</span> Remote Access Setup</h2>
<div class="outline-text-2" id="text-7">
<p>
This section covers how to access org-roam from anywhere using cloud servers (AWS EC2, VPS, etc.) instead of Notion or Obsidian.
</p>
</div>

<div id="outline-container-org4759cd3" class="outline-3">
<h3 id="org4759cd3"><span class="section-number-3">7.1.</span> Overview of Remote Access Approaches</h3>
<div class="outline-text-3" id="text-7-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Approach</th>
<th scope="col" class="org-left">Pros</th>
<th scope="col" class="org-left">Cons</th>
<th scope="col" class="org-left">Best For</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">SSH + Mosh</td>
<td class="org-left">Low latency, no sync conflicts</td>
<td class="org-left">Requires network</td>
<td class="org-left">Primary remote workflow</td>
</tr>

<tr>
<td class="org-left">org-roam-ui Web</td>
<td class="org-left">Mobile-friendly, visual</td>
<td class="org-left">Read-only</td>
<td class="org-left">Browsing on mobile</td>
</tr>

<tr>
<td class="org-left">Git Sync</td>
<td class="org-left">Offline access, version control</td>
<td class="org-left">Manual conflicts</td>
<td class="org-left">Multiple devices</td>
</tr>

<tr>
<td class="org-left">TRAMP</td>
<td class="org-left">Use local Emacs</td>
<td class="org-left">Some lag</td>
<td class="org-left">Occasional remote editing</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org1b42419" class="outline-3">
<h3 id="org1b42419"><span class="section-number-3">7.2.</span> AWS EC2 / VPS Setup Guide</h3>
<div class="outline-text-3" id="text-7-2">
</div>
<div id="outline-container-orge3d1942" class="outline-4">
<h4 id="orge3d1942"><span class="section-number-4">7.2.1.</span> Initial Server Setup</h4>
<div class="outline-text-4" id="text-7-2-1">
<p>
<b>Prerequisites:</b>
</p>
<ul class="org-ul">
<li>AWS account or any VPS provider (DigitalOcean, Linode, etc.)</li>
<li>SSH key pair configured</li>
</ul>

<p>
<b>Launch Instance:</b>
</p>
<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">Recommended specs:
</span><span class="org-comment-delimiter"># </span><span class="org-comment">- t2.micro or t3.micro (AWS free tier)
</span><span class="org-comment-delimiter"># </span><span class="org-comment">- Ubuntu 24.04 LTS
</span><span class="org-comment-delimiter"># </span><span class="org-comment">- 1GB RAM minimum, 20GB disk
</span><span class="org-comment-delimiter"># </span><span class="org-comment">- Security group: SSH (22), Mosh (60000-61000 UDP), optional HTTP (8080)</span>
</pre>
</div>

<p>
<b>Install dependencies on server:</b>
</p>
<div class="org-src-container">
<pre class="src src-shell">sudo apt update &amp;&amp; sudo apt install -y <span class="org-sh-escaped-newline">\</span>
  emacs-nox <span class="org-sh-escaped-newline">\</span>
  tmux <span class="org-sh-escaped-newline">\</span>
  mosh <span class="org-sh-escaped-newline">\</span>
  sqlite3 <span class="org-sh-escaped-newline">\</span>
  ripgrep <span class="org-sh-escaped-newline">\</span>
  git <span class="org-sh-escaped-newline">\</span>
  build-essential
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf6348f4" class="outline-4">
<h4 id="orgf6348f4"><span class="section-number-4">7.2.2.</span> Transfer Org-Roam Files</h4>
<div class="outline-text-4" id="text-7-2-2">
<p>
<b>Option 1: Git (recommended)</b>
</p>
<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">On local machine - push org-roam to Git
</span><span class="org-builtin">cd</span> ~/org-roam
git init
<span class="org-builtin">echo</span> <span class="org-string">"org-roam.db"</span> &gt;&gt; .gitignore  <span class="org-comment-delimiter"># </span><span class="org-comment">IMPORTANT: Never sync database!
</span>git add .
git commit -m <span class="org-string">"Initial org-roam commit"</span>
git remote add origin &lt;your-repo-url&gt;
git push -u origin main

<span class="org-comment-delimiter"># </span><span class="org-comment">On EC2 server - clone repository
</span>git clone &lt;your-repo-url&gt; ~/org-roam
</pre>
</div>

<p>
<b>Option 2: SCP (one-time copy)</b>
</p>
<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">Copy from local to server (excludes database)
</span>rsync -avz --exclude=<span class="org-string">'org-roam.db'</span> ~/org-roam/ user@ec2-ip:~/org-roam/
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf23a25f" class="outline-4">
<h4 id="orgf23a25f"><span class="section-number-4">7.2.3.</span> Configure Emacs on Server</h4>
<div class="outline-text-4" id="text-7-2-3">
<p>
<b>Transfer your Emacs configuration:</b>
</p>
<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">Option 1: If using this repository
</span><span class="org-builtin">cd</span> ~/Projects/mandoo180.github.io
git push
<span class="org-comment-delimiter"># </span><span class="org-comment">Then on server:
</span>git clone &lt;this-repo-url&gt;
<span class="org-builtin">cd</span> mandoo180.github.io
./tangle.sh

<span class="org-comment-delimiter"># </span><span class="org-comment">Option 2: Copy specific config
</span>scp -r ~/.emacs.d/elisp/settings/org-conf.el user@ec2-ip:~/.emacs.d/elisp/settings/
</pre>
</div>

<p>
<b>Start Emacs daemon:</b>
</p>
<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">On server
</span>emacs --daemon
</pre>
</div>
</div>
</div>
