content/emacs/configs/07-org.org
*** Systemd Service for Auto-Start

Create a systemd service to start Emacs daemon automatically on boot.

#+begin_src conf :tangle no
# ~/.config/systemd/user/emacs.service
[Unit]
Description=Emacs text editor daemon
Documentation=info:emacs man:emacs(1) https://gnu.org/software/emacs/

[Service]
Type=notify
ExecStart=/usr/bin/emacs --fg-daemon
ExecStop=/usr/bin/emacsclient --eval "(kill-emacs)"
Environment=SSH_AUTH_SOCK=%t/keyring/ssh
Restart=on-failure

[Install]
WantedBy=default.target
#+end_src

*Enable the service:*
#+begin_src shell
# On server
mkdir -p ~/.config/systemd/user
# Create the service file above, then:
systemctl --user enable emacs.service
systemctl --user start emacs.service
systemctl --user status emacs.service
#+end_src

** Fast SSH Access with Mosh

Mosh (Mobile Shell) provides near-zero latency for remote Emacs usage.

*** Install Mosh

*On your local machine (macOS):*
#+begin_src shell
brew install mosh
#+end_src

*On server:*
#+begin_src shell
sudo apt install mosh
#+end_src

*** Configure Firewall

*AWS Security Group:*
- Add inbound rule: UDP ports 60000-61000 from your IP

*UFW (on server):*
#+begin_src shell
sudo ufw allow 60000:61000/udp
#+end_src

*** Connect with Mosh

#+begin_src shell
# Instead of: ssh user@ec2-ip
mosh user@ec2-ip

# Inside mosh session
tmux attach || tmux new
emacsclient -nw

# Your org-roam is now accessible!
C-c n f  # Find notes
C-c n u  # Open web UI
#+end_src

*Benefits over SSH:*
- Typing appears instantly (local echo)
- Survives network changes (WiFi → cellular)
- Automatic reconnection after laptop sleep
- Works on spotty connections

** org-roam-ui for Mobile Web Access

Access your knowledge graph from any device with a web browser.

*** Local Access (SSH Tunnel)

Most secure method - UI only accessible through SSH tunnel.

*In terminal:*
#+begin_src shell
# Create SSH tunnel
ssh -L 35901:localhost:35901 user@ec2-ip

# Keep this terminal open, then in Emacs on server:
M-x org-roam-ui-mode
#+end_src

*Access on any device:*
- Open browser to =http://localhost:35901=
- Works on desktop, phone, tablet
- No public exposure

*** Remote Access (Bind to Public IP)

For direct access without SSH tunnel (less secure).

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/org-conf-remote.el
  ;;; org-conf-remote.el --- Remote access configuration  -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;; Configuration for accessing org-roam-ui from remote devices
  ;;; Code:

  ;; Only enable this on your remote server, not local machine
  (when (getenv "ORG_ROAM_REMOTE")
    (use-package org-roam-ui
      :custom
      ;; Bind to all interfaces for remote access
      (org-roam-ui-host "0.0.0.0")  ;; WARNING: Exposes to internet
      (org-roam-ui-port 8080)       ;; Or use reverse proxy

      ;; Optional: Add basic auth via reverse proxy (nginx/caddy)
      ;; See nginx configuration example below
      ))

  (provide 'org-conf-remote)
  ;;; org-conf-remote.el ends here
#+end_src

*Set environment variable on server:*
#+begin_src shell
# Add to ~/.bashrc or ~/.zshrc
export ORG_ROAM_REMOTE=1
#+end_src

*Secure with reverse proxy (Nginx example):*
#+begin_src nginx :tangle no
# /etc/nginx/sites-available/org-roam
server {
    listen 80;
    server_name roam.yourdomain.com;

    # Basic authentication
    auth_basic "Org-Roam Access";
    auth_basic_user_file /etc/nginx/.htpasswd;

    location / {
        proxy_pass http://localhost:35901;
        proxy_http_version 1.1;
        proxy_set_header Upgrade $http_upgrade;
        proxy_set_header Connection "upgrade";
        proxy_set_header Host $host;
    }
}
#+end_src

** iOS Quick Capture Setup

For capturing notes on iPhone/iPad while org-roam runs on server.

*** Option 1: Working Copy + Git Sync

*Setup:*
1. Install [[https://workingcopy.app/][Working Copy]] app (iOS Git client)
2. Clone your org-roam repository
3. Install [[https://www.beorgapp.com/][beorg]] or [[https://plainorg.com/][Plain Org]] for editing
4. Configure beorg to use Working Copy directory

*Workflow:*
1. Create/edit notes in beorg
2. Switch to Working Copy
3. Commit and push changes
4. On server: =git pull= (or set up auto-pull)
5. =M-x org-roam-db-sync= in Emacs

*** Option 2: SSH Terminal App

*Install terminal app with mosh support:*
- [[https://blink.sh/][Blink Shell]] (iOS) - supports mosh
- [[https://termius.com/][Termius]] - user-friendly SSH client

*Connect to your server:*
#+begin_src shell
mosh user@ec2-ip
tmux attach
emacsclient -nw
# Full org-roam access on iPhone!
#+end_src

** Git Sync Workflow

For offline access and automatic synchronization.

