emacs/configs/07-org.html

<div id="outline-container-orgfc72c5c" class="outline-4">
<h4 id="orgfc72c5c"><span class="section-number-4">7.2.4.</span> Systemd Service for Auto-Start</h4>
<div class="outline-text-4" id="text-7-2-4">
<p>
Create a systemd service to start Emacs daemon automatically on boot.
</p>

<div class="org-src-container">
<pre class="src src-conf"><span class="org-comment-delimiter"># </span><span class="org-comment">~/.config/systemd/user/emacs.service
</span>[<span class="org-type">Unit</span>]
<span class="org-variable-name">Description</span>=Emacs text editor daemon
<span class="org-variable-name">Documentation</span>=info:emacs man:emacs(1) https://gnu.org/software/emacs/

[<span class="org-type">Service</span>]
<span class="org-variable-name">Type</span>=notify
<span class="org-variable-name">ExecStart</span>=/usr/bin/emacs --fg-daemon
<span class="org-variable-name">ExecStop</span>=/usr/bin/emacsclient --eval <span class="org-string">"(kill-emacs)"</span>
<span class="org-variable-name">Environment</span>=SSH_AUTH_SOCK=%t/keyring/ssh
<span class="org-variable-name">Restart</span>=on-failure

[<span class="org-type">Install</span>]
<span class="org-variable-name">WantedBy</span>=default.target
</pre>
</div>

<p>
<b>Enable the service:</b>
</p>
<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">On server
</span>mkdir -p ~/.config/systemd/user
<span class="org-comment-delimiter"># </span><span class="org-comment">Create the service file above, then:
</span>systemctl --user enable emacs.service
systemctl --user start emacs.service
systemctl --user status emacs.service
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc71c3f5" class="outline-3">
<h3 id="orgc71c3f5"><span class="section-number-3">7.3.</span> Fast SSH Access with Mosh</h3>
<div class="outline-text-3" id="text-7-3">
<p>
Mosh (Mobile Shell) provides near-zero latency for remote Emacs usage.
</p>
</div>

<div id="outline-container-org74df9fe" class="outline-4">
<h4 id="org74df9fe"><span class="section-number-4">7.3.1.</span> Install Mosh</h4>
<div class="outline-text-4" id="text-7-3-1">
<p>
<b>On your local machine (macOS):</b>
</p>
<div class="org-src-container">
<pre class="src src-shell">brew install mosh
</pre>
</div>

<p>
<b>On server:</b>
</p>
<div class="org-src-container">
<pre class="src src-shell">sudo apt install mosh
</pre>
</div>
</div>
</div>

<div id="outline-container-org3908fc9" class="outline-4">
<h4 id="org3908fc9"><span class="section-number-4">7.3.2.</span> Configure Firewall</h4>
<div class="outline-text-4" id="text-7-3-2">
<p>
<b>AWS Security Group:</b>
</p>
<ul class="org-ul">
<li>Add inbound rule: UDP ports 60000-61000 from your IP</li>
</ul>

<p>
<b>UFW (on server):</b>
</p>
<div class="org-src-container">
<pre class="src src-shell">sudo ufw allow 60000:61000/udp
</pre>
</div>
</div>
</div>

<div id="outline-container-org1bcf541" class="outline-4">
<h4 id="org1bcf541"><span class="section-number-4">7.3.3.</span> Connect with Mosh</h4>
<div class="outline-text-4" id="text-7-3-3">
<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">Instead of: ssh user@ec2-ip
</span>mosh user@ec2-ip

<span class="org-comment-delimiter"># </span><span class="org-comment">Inside mosh session
</span>tmux attach || tmux new
emacsclient -nw

<span class="org-comment-delimiter"># </span><span class="org-comment">Your org-roam is now accessible!
</span>C-c n f  <span class="org-comment-delimiter"># </span><span class="org-comment">Find notes
</span>C-c n u  <span class="org-comment-delimiter"># </span><span class="org-comment">Open web UI</span>
</pre>
</div>

<p>
<b>Benefits over SSH:</b>
</p>
<ul class="org-ul">
<li>Typing appears instantly (local echo)</li>
<li>Survives network changes (WiFi  cellular)</li>
<li>Automatic reconnection after laptop sleep</li>
<li>Works on spotty connections</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgea61317" class="outline-3">
<h3 id="orgea61317"><span class="section-number-3">7.4.</span> org-roam-ui for Mobile Web Access</h3>
<div class="outline-text-3" id="text-7-4">
<p>
Access your knowledge graph from any device with a web browser.
</p>
</div>

<div id="outline-container-org42eeec3" class="outline-4">
<h4 id="org42eeec3"><span class="section-number-4">7.4.1.</span> Local Access (SSH Tunnel)</h4>
<div class="outline-text-4" id="text-7-4-1">
<p>
Most secure method - UI only accessible through SSH tunnel.
</p>

<p>
<b>In terminal:</b>
</p>
<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">Create SSH tunnel
</span>ssh -L 35901:localhost:35901 user@ec2-ip

<span class="org-comment-delimiter"># </span><span class="org-comment">Keep this terminal open, then in Emacs on server:
</span>M-x org-roam-ui-mode
</pre>
</div>

<p>
<b>Access on any device:</b>
</p>
<ul class="org-ul">
<li>Open browser to <code>http://localhost:35901</code></li>
<li>Works on desktop, phone, tablet</li>
<li>No public exposure</li>
</ul>
</div>
</div>

<div id="outline-container-orgc77091f" class="outline-4">
<h4 id="orgc77091f"><span class="section-number-4">7.4.2.</span> Remote Access (Bind to Public IP)</h4>
<div class="outline-text-4" id="text-7-4-2">
<p>
For direct access without SSH tunnel (less secure).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">org-conf-remote.el --- Remote access configuration  -*- lexical-binding: t; -*-
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">Configuration for accessing org-roam-ui from remote devices
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Only enable this on your remote server, not local machine
</span>(<span class="org-keyword">when</span> (getenv <span class="org-string">"ORG_ROAM_REMOTE"</span>)
  (<span class="org-keyword">use-package</span> org-roam-ui
    <span class="org-builtin">:custom</span>
    <span class="org-comment-delimiter">;; </span><span class="org-comment">Bind to all interfaces for remote access
</span>    (org-roam-ui-host <span class="org-string">"0.0.0.0"</span>)  <span class="org-comment-delimiter">;; </span><span class="org-comment">WARNING: Exposes to internet
</span>    (org-roam-ui-port 8080)       <span class="org-comment-delimiter">;; </span><span class="org-comment">Or use reverse proxy
</span>
    <span class="org-comment-delimiter">;; </span><span class="org-comment">Optional: Add basic auth via reverse proxy (nginx/caddy)
</span>    <span class="org-comment-delimiter">;; </span><span class="org-comment">See nginx configuration example below
</span>    ))

(<span class="org-keyword">provide</span> '<span class="org-constant">org-conf-remote</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">org-conf-remote.el ends here</span>
</pre>
</div>

<p>
<b>Set environment variable on server:</b>
</p>
<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">Add to ~/.bashrc or ~/.zshrc
</span><span class="org-builtin">export</span> <span class="org-variable-name">ORG_ROAM_REMOTE</span>=1
</pre>
</div>

<p>
<b>Secure with reverse proxy (Nginx example):</b>
</p>
<div class="org-src-container">
<pre class="src src-nginx"># /etc/nginx/sites-available/org-roam
server {
    listen 80;
    server_name roam.yourdomain.com;

    # Basic authentication
    auth_basic "Org-Roam Access";
    auth_basic_user_file /etc/nginx/.htpasswd;

    location / {
        proxy_pass http://localhost:35901;
        proxy_http_version 1.1;
        proxy_set_header Upgrade $http_upgrade;
        proxy_set_header Connection "upgrade";
        proxy_set_header Host $host;
    }
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf5299d7" class="outline-3">
<h3 id="orgf5299d7"><span class="section-number-3">7.5.</span> iOS Quick Capture Setup</h3>
<div class="outline-text-3" id="text-7-5">
<p>
For capturing notes on iPhone/iPad while org-roam runs on server.
</p>
</div>

<div id="outline-container-orgda6f1b8" class="outline-4">
<h4 id="orgda6f1b8"><span class="section-number-4">7.5.1.</span> Option 1: Working Copy + Git Sync</h4>
<div class="outline-text-4" id="text-7-5-1">
<p>
<b>Setup:</b>
</p>
<ol class="org-ol">
<li>Install <a href="https://workingcopy.app/">Working Copy</a> app (iOS Git client)</li>
<li>Clone your org-roam repository</li>
<li>Install <a href="https://www.beorgapp.com/">beorg</a> or <a href="https://plainorg.com/">Plain Org</a> for editing</li>
<li>Configure beorg to use Working Copy directory</li>
</ol>

<p>
<b>Workflow:</b>
</p>
<ol class="org-ol">
<li>Create/edit notes in beorg</li>
<li>Switch to Working Copy</li>
<li>Commit and push changes</li>
<li>On server: <code>git pull</code> (or set up auto-pull)</li>
<li><code>M-x org-roam-db-sync</code> in Emacs</li>
</ol>
</div>
</div>

<div id="outline-container-org3ca9b3c" class="outline-4">
<h4 id="org3ca9b3c"><span class="section-number-4">7.5.2.</span> Option 2: SSH Terminal App</h4>
<div class="outline-text-4" id="text-7-5-2">
<p>
<b>Install terminal app with mosh support:</b>
</p>
<ul class="org-ul">
<li><a href="https://blink.sh/">Blink Shell</a> (iOS) - supports mosh</li>
<li><a href="https://termius.com/">Termius</a> - user-friendly SSH client</li>
</ul>

<p>
<b>Connect to your server:</b>
</p>
<div class="org-src-container">
<pre class="src src-shell">mosh user@ec2-ip
tmux attach
emacsclient -nw
<span class="org-comment-delimiter"># </span><span class="org-comment">Full org-roam access on iPhone!</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc389e73" class="outline-3">
<h3 id="orgc389e73"><span class="section-number-3">7.6.</span> Git Sync Workflow</h3>
<div class="outline-text-3" id="text-7-6">
<p>
For offline access and automatic synchronization.
</p>
</div>
