content/emacs/configs/07-org.org
*** Auto-Commit Script

#+begin_src shell :tangle no :shebang "#!/bin/bash"
# ~/bin/org-roam-sync.sh
# Automatically sync org-roam changes

cd ~/org-roam || exit

# Pull latest changes
git pull --rebase

# Add all changes
git add *.org

# Commit if there are changes
if ! git diff-index --quiet HEAD --; then
    git commit -m "Auto-sync: $(date '+%Y-%m-%d %H:%M')"
    git push
    echo "Changes synced at $(date)"
fi
#+end_src

*Set up cron job (run every 5 minutes):*
#+begin_src shell
crontab -e
# Add line:
*/5 * * * * ~/bin/org-roam-sync.sh >> ~/logs/org-sync.log 2>&1
#+end_src

*Sync database after pull:*
#+begin_src emacs-lisp :tangle no
;; Auto-sync database when files change
(defun fu/org-roam-auto-sync ()
  "Automatically sync org-roam database when files change."
  (when (and (buffer-file-name)
             (string-prefix-p (expand-file-name org-roam-directory)
                            (buffer-file-name)))
    (org-roam-db-sync)))

(add-hook 'after-save-hook #'fu/org-roam-auto-sync)
#+end_src

** Backup Strategy

*** Git as Backup

Your Git repository serves as automatic backup:
#+begin_src shell
# All changes are version controlled
git log --oneline  # See history
git show <commit>  # View specific changes
git checkout <commit> -- file.org  # Restore old version
#+end_src

*** S3 Backup (AWS)

For additional cloud backup:
#+begin_src shell
# Install AWS CLI
sudo apt install awscli

# Configure credentials
aws configure

# Backup script
aws s3 sync ~/org-roam/ s3://my-org-roam-backup/ \
    --exclude "*.db" \
    --exclude ".git/*"
#+end_src

** Daily Workflow Examples

*** Morning Routine (Desktop)
#+begin_src shell
# Connect to server
mosh user@ec2-ip

# Start/resume tmux session
tmux attach || tmux new

# Start Emacs
emacsclient -nw

# Check daily notes
C-c n t  # Today's note
C-c n l  # View backlinks
C-c n u  # Open graph on tablet
#+end_src

*** Quick Capture (Mobile - iOS)
1. Open Blink Shell on iPhone
2. =mosh user@server=
3. =C-c n j= for quick journal entry
4. Type note and save
5. Swipe away - session persists

*** Browsing on iPad
1. Safari → =http://localhost:35901= (if SSH tunnel running)
2. Or direct IP if configured with auth
3. Explore graph visually
4. Click nodes to read content

** Troubleshooting

*** Database Issues

*Symptom:* "Database version mismatch" error

*Solution:*
#+begin_src shell
# Delete database and regenerate
rm ~/.emacs.d/org-roam.db
# In Emacs:
M-x org-roam-db-sync
#+end_src

*** Mosh Won't Connect

*Check firewall:*
#+begin_src shell
# On server
sudo ufw status
sudo ufw allow 60000:61000/udp

# AWS Security Group
# Add UDP 60000-61000 inbound rule
#+end_src

*** Emacs Daemon Not Starting

*Check status:*
#+begin_src shell
systemctl --user status emacs.service
journalctl --user -u emacs.service -f
#+end_src

*Manual start:*
#+begin_src shell
emacs --daemon --debug-init
#+end_src

*** org-roam-ui Not Accessible

*Verify it's running:*
#+begin_src shell
# On server
netstat -tlnp | grep 35901
# or
lsof -i :35901
#+end_src

*Test locally first:*
#+begin_src shell
# SSH into server
curl http://localhost:35901
# Should return HTML
#+end_src

** Cost Estimation

*** AWS EC2 Free Tier
- t2.micro: Free for 12 months (750 hours/month)
- After free tier: ~$8/month
- Storage: 20GB free tier

*** Alternative VPS Providers
- DigitalOcean: $4/month (basic droplet)
- Linode: $5/month (Nanode 1GB)
- Hetzner: €3.79/month (CX11)

*** Total Monthly Cost
- Server: $0-8/month
- iOS apps: $0-15 (one-time for beorg)
- **Total: $0-10/month** vs Notion ($12/mo) or Obsidian Sync ($4/mo)

