emacs/configs/07-org.html

<div id="outline-container-orgf90b0c4" class="outline-4">
<h4 id="orgf90b0c4"><span class="section-number-4">7.6.1.</span> Auto-Commit Script</h4>
<div class="outline-text-4" id="text-7-6-1">
<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">~/bin/org-roam-sync.sh
</span><span class="org-comment-delimiter"># </span><span class="org-comment">Automatically sync org-roam changes
</span>
<span class="org-builtin">cd</span> ~/org-roam || <span class="org-keyword">exit</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Pull latest changes
</span>git pull --rebase

<span class="org-comment-delimiter"># </span><span class="org-comment">Add all changes
</span>git add *.org

<span class="org-comment-delimiter"># </span><span class="org-comment">Commit if there are changes
</span><span class="org-keyword">if</span> <span class="org-negation-char">!</span> git diff-index --quiet HEAD --; <span class="org-keyword">then</span>
    git commit -m <span class="org-string">"Auto-sync: $(</span><span class="org-sh-quoted-exec">date '+%Y-%m-%d %H:%M'</span><span class="org-string">)"</span>
    git push
    <span class="org-builtin">echo</span> <span class="org-string">"Changes synced at $(</span><span class="org-sh-quoted-exec">date</span><span class="org-string">)"</span>
<span class="org-keyword">fi</span>
</pre>
</div>

<p>
<b>Set up cron job (run every 5 minutes):</b>
</p>
<div class="org-src-container">
<pre class="src src-shell">crontab -e
<span class="org-comment-delimiter"># </span><span class="org-comment">Add line:
</span>*/5 * * * * ~/bin/org-roam-sync.sh &gt;&gt; ~/logs/org-sync.log 2&gt;&amp;1
</pre>
</div>

<p>
<b>Sync database after pull:</b>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Auto-sync database when files change
</span>(<span class="org-keyword">defun</span> <span class="org-function-name">fu/org-roam-auto-sync</span> ()
  <span class="org-doc">"Automatically sync org-roam database when files change."</span>
  (<span class="org-keyword">when</span> (<span class="org-keyword">and</span> (buffer-file-name)
             (string-prefix-p (expand-file-name org-roam-directory)
                            (buffer-file-name)))
    (org-roam-db-sync)))

(add-hook 'after-save-hook #'fu/org-roam-auto-sync)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org5a7a028" class="outline-3">
<h3 id="org5a7a028"><span class="section-number-3">7.7.</span> Backup Strategy</h3>
<div class="outline-text-3" id="text-7-7">
</div>
<div id="outline-container-orga1fd5c5" class="outline-4">
<h4 id="orga1fd5c5"><span class="section-number-4">7.7.1.</span> Git as Backup</h4>
<div class="outline-text-4" id="text-7-7-1">
<p>
Your Git repository serves as automatic backup:
</p>
<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">All changes are version controlled
</span>git log --oneline  <span class="org-comment-delimiter"># </span><span class="org-comment">See history
</span>git show &lt;commit&gt;  <span class="org-comment-delimiter"># </span><span class="org-comment">View specific changes
</span>git checkout &lt;commit&gt; -- file.org  <span class="org-comment-delimiter"># </span><span class="org-comment">Restore old version</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org34ea432" class="outline-4">
<h4 id="org34ea432"><span class="section-number-4">7.7.2.</span> S3 Backup (AWS)</h4>
<div class="outline-text-4" id="text-7-7-2">
<p>
For additional cloud backup:
</p>
<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">Install AWS CLI
</span>sudo apt install awscli

<span class="org-comment-delimiter"># </span><span class="org-comment">Configure credentials
</span>aws configure

<span class="org-comment-delimiter"># </span><span class="org-comment">Backup script
</span>aws s3 sync ~/org-roam/ s3://my-org-roam-backup/ <span class="org-sh-escaped-newline">\</span>
    --exclude <span class="org-string">"*.db"</span> <span class="org-sh-escaped-newline">\</span>
    --exclude <span class="org-string">".git/*"</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org44d8773" class="outline-3">
<h3 id="org44d8773"><span class="section-number-3">7.8.</span> Daily Workflow Examples</h3>
<div class="outline-text-3" id="text-7-8">
</div>
<div id="outline-container-org0d21e34" class="outline-4">
<h4 id="org0d21e34"><span class="section-number-4">7.8.1.</span> Morning Routine (Desktop)</h4>
<div class="outline-text-4" id="text-7-8-1">
<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">Connect to server
</span>mosh user@ec2-ip

<span class="org-comment-delimiter"># </span><span class="org-comment">Start/resume tmux session
</span>tmux attach || tmux new

<span class="org-comment-delimiter"># </span><span class="org-comment">Start Emacs
</span>emacsclient -nw

<span class="org-comment-delimiter"># </span><span class="org-comment">Check daily notes
</span>C-c n t  <span class="org-comment-delimiter"># </span><span class="org-comment">Today's note
</span>C-c n l  <span class="org-comment-delimiter"># </span><span class="org-comment">View backlinks
</span>C-c n u  <span class="org-comment-delimiter"># </span><span class="org-comment">Open graph on tablet</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org13b3261" class="outline-4">
<h4 id="org13b3261"><span class="section-number-4">7.8.2.</span> Quick Capture (Mobile - iOS)</h4>
<div class="outline-text-4" id="text-7-8-2">
<ol class="org-ol">
<li>Open Blink Shell on iPhone</li>
<li><code>mosh user@server</code></li>
<li><code>C-c n j</code> for quick journal entry</li>
<li>Type note and save</li>
<li>Swipe away - session persists</li>
</ol>
</div>
</div>

<div id="outline-container-org04845f3" class="outline-4">
<h4 id="org04845f3"><span class="section-number-4">7.8.3.</span> Browsing on iPad</h4>
<div class="outline-text-4" id="text-7-8-3">
<ol class="org-ol">
<li>Safari  <code>http://localhost:35901</code> (if SSH tunnel running)</li>
<li>Or direct IP if configured with auth</li>
<li>Explore graph visually</li>
<li>Click nodes to read content</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org253e866" class="outline-3">
<h3 id="org253e866"><span class="section-number-3">7.9.</span> Troubleshooting</h3>
<div class="outline-text-3" id="text-7-9">
</div>
<div id="outline-container-orgada728b" class="outline-4">
<h4 id="orgada728b"><span class="section-number-4">7.9.1.</span> Database Issues</h4>
<div class="outline-text-4" id="text-7-9-1">
<p>
<b>Symptom:</b> "Database version mismatch" error
</p>

<p>
<b>Solution:</b>
</p>
<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">Delete database and regenerate
</span>rm ~/.emacs.d/org-roam.db
<span class="org-comment-delimiter"># </span><span class="org-comment">In Emacs:
</span>M-x org-roam-db-sync
</pre>
</div>
</div>
</div>

<div id="outline-container-org82133bd" class="outline-4">
<h4 id="org82133bd"><span class="section-number-4">7.9.2.</span> Mosh Won't Connect</h4>
<div class="outline-text-4" id="text-7-9-2">
<p>
<b>Check firewall:</b>
</p>
<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">On server
</span>sudo ufw status
sudo ufw allow 60000:61000/udp

<span class="org-comment-delimiter"># </span><span class="org-comment">AWS Security Group
</span><span class="org-comment-delimiter"># </span><span class="org-comment">Add UDP 60000-61000 inbound rule</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0423743" class="outline-4">
<h4 id="org0423743"><span class="section-number-4">7.9.3.</span> Emacs Daemon Not Starting</h4>
<div class="outline-text-4" id="text-7-9-3">
<p>
<b>Check status:</b>
</p>
<div class="org-src-container">
<pre class="src src-shell">systemctl --user status emacs.service
journalctl --user -u emacs.service -f
</pre>
</div>

<p>
<b>Manual start:</b>
</p>
<div class="org-src-container">
<pre class="src src-shell">emacs --daemon --debug-init
</pre>
</div>
</div>
</div>

<div id="outline-container-org89da73b" class="outline-4">
<h4 id="org89da73b"><span class="section-number-4">7.9.4.</span> org-roam-ui Not Accessible</h4>
<div class="outline-text-4" id="text-7-9-4">
<p>
<b>Verify it's running:</b>
</p>
<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">On server
</span>netstat -tlnp | grep 35901
<span class="org-comment-delimiter"># </span><span class="org-comment">or
</span>lsof -i :35901
</pre>
</div>

<p>
<b>Test locally first:</b>
</p>
<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">SSH into server
</span>curl http://localhost:35901
<span class="org-comment-delimiter"># </span><span class="org-comment">Should return HTML</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9d9a380" class="outline-3">
<h3 id="org9d9a380"><span class="section-number-3">7.10.</span> Cost Estimation</h3>
<div class="outline-text-3" id="text-7-10">
</div>
<div id="outline-container-org7f9eb5c" class="outline-4">
<h4 id="org7f9eb5c"><span class="section-number-4">7.10.1.</span> AWS EC2 Free Tier</h4>
<div class="outline-text-4" id="text-7-10-1">
<ul class="org-ul">
<li>t2.micro: Free for 12 months (750 hours/month)</li>
<li>After free tier: ~$8/month</li>
<li>Storage: 20GB free tier</li>
</ul>
</div>
</div>

<div id="outline-container-orgb2bbb6d" class="outline-4">
<h4 id="orgb2bbb6d"><span class="section-number-4">7.10.2.</span> Alternative VPS Providers</h4>
<div class="outline-text-4" id="text-7-10-2">
<ul class="org-ul">
<li>DigitalOcean: $4/month (basic droplet)</li>
<li>Linode: $5/month (Nanode 1GB)</li>
<li>Hetzner: 3.79/month (CX11)</li>
</ul>
</div>
</div>

<div id="outline-container-org71152c5" class="outline-4">
<h4 id="org71152c5"><span class="section-number-4">7.10.3.</span> Total Monthly Cost</h4>
<div class="outline-text-4" id="text-7-10-3">
<ul class="org-ul">
<li>Server: $0-8/month</li>
<li>iOS apps: $0-15 (one-time for beorg)</li>
<li><b><b>Total: $0-10/month</b></b> vs Notion ($12/mo) or Obsidian Sync ($4/mo)</li>
</ul>
</div>
</div>
</div>
