emacs/configs/07-org.html

<div id="outline-container-org3c0c616" class="outline-3">
<h3 id="org3c0c616"><span class="section-number-3">7.11.</span> Comparison to Notion/Obsidian</h3>
<div class="outline-text-3" id="text-7-11">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Feature</th>
<th scope="col" class="org-left">Org-Roam (Remote)</th>
<th scope="col" class="org-left">Obsidian</th>
<th scope="col" class="org-left">Notion</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Cost</td>
<td class="org-left">$0-10/mo</td>
<td class="org-left">$4/mo (sync)</td>
<td class="org-left">$12/mo</td>
</tr>

<tr>
<td class="org-left">Mobile apps</td>
<td class="org-left">Terminal/web</td>
<td class="org-left">Native</td>
<td class="org-left">Native</td>
</tr>

<tr>
<td class="org-left">Offline</td>
<td class="org-left">Optional</td>
<td class="org-left">Yes</td>
<td class="org-left">Limited</td>
</tr>

<tr>
<td class="org-left">Privacy</td>
<td class="org-left">Full control</td>
<td class="org-left">Full control</td>
<td class="org-left">Cloud-based</td>
</tr>

<tr>
<td class="org-left">Sync</td>
<td class="org-left">Manual/Git</td>
<td class="org-left">Auto</td>
<td class="org-left">Auto</td>
</tr>

<tr>
<td class="org-left">Learning curve</td>
<td class="org-left">High</td>
<td class="org-left">Medium</td>
<td class="org-left">Low</td>
</tr>
</tbody>
</table>

<p>
<b>Advantages of remote org-roam:</b>
</p>
<ul class="org-ul">
<li> Single source of truth (no conflicts)</li>
<li> Full Emacs power</li>
<li> Plain text + version control</li>
<li> Zero vendor lock-in</li>
<li> Works on any device with SSH</li>
</ul>

<p>
<b>Disadvantages:</b>
</p>
<ul class="org-ul">
<li> Requires technical setup</li>
<li> No native mobile apps</li>
<li> Needs network for full features</li>
</ul>
</div>
</div>

<div id="outline-container-org7097c9d" class="outline-3">
<h3 id="org7097c9d"><span class="section-number-3">7.12.</span> References and Resources</h3>
<div class="outline-text-3" id="text-7-12">
<ul class="org-ul">
<li><a href="https://mosh.org/">Mosh (Mobile Shell)</a></li>
<li><a href="https://github.com/org-roam/org-roam-ui">org-roam-ui GitHub</a></li>
<li><a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Emacs-Server.html">Emacs Server Documentation</a></li>
<li><a href="https://blink.sh/">Blink Shell (iOS)</a></li>
<li><a href="https://www.beorgapp.com/">beorg (iOS Org-mode app)</a></li>
<li><a href="https://plainorg.com/">Plain Org (iOS)</a></li>
</ul>
</div>
</div>
</div>
</main>
</body>
</html>
